[
  {
    "heroId": "abaddon",
    "mood": "defensive",
    "items": [
      {
        "id": "phase_boots",
        "name": "Phase Boots",
        "cost": 1500,
        "phase": "Early",
        "priority": "Core",
        "description": "Provides armor and mobility to stay on top of enemies or allies."
      },
      {
        "id": "orb_of_corrosion",
        "name": "Orb of Corrosion",
        "cost": 900,
        "phase": "Early",
        "priority": "Core",
        "description": "Early game slow and armor reduction to enhance kill potential."
      },
      {
        "id": "echo_sabre",
        "name": "Echo Sabre",
        "cost": 2500,
        "phase": "Mid",
        "priority": "Core",
        "description": "Double attack synergizes perfectly with Curse of Avernus."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Mid",
        "priority": "Core",
        "description": "Essential for initiating and positioning to save allies."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Massively increases team survivability during Borrowed Time."
      },
      {
        "id": "assault",
        "name": "Assault Cuirass",
        "cost": 5125,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Boosts team armor and attack speed, making you a formidable frontliner."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Aphotic Shield to save allies from stuns and damage.",
        "Act as a frontline, drawing fire to trigger your ultimate.",
        "Dispel key debuffs from your cores with your shield.",
        "Use Mist Coil to secure kills or deny yourself.",
        "Be aggressive in lane with your shield and passive."
      ],
      "donts": [
        "Don't be afraid to take damage when your ultimate is ready.",
        "Don't use Aphotic Shield on yourself if an ally is in greater danger.",
        "Don't build pure damage items; your value is in utility and survivability.",
        "Don't waste Borrowed Time; use it to turn a fight.",
        "Don't forget you can manually activate your ultimate."
      ],
      "tips": [
        "Aphotic Shield has a strong dispel, removing stuns and silences.",
        "You can deny yourself with Mist Coil if you are about to die.",
        "Curse of Avernus applies on buildings, making you a decent pusher.",
        "With Agh's, try to have all allies near you when you use your ultimate.",
        "A Harpoon upgrade from Echo Sabre can be a great late-game pickup."
      ]
    },
    "gameplan": {
      "early": "Dominate your lane by trading aggressively with Aphotic Shield. Harass the enemy carry and secure farm for your own core.",
      "mid": "With Echo Sabre and Blink, become a major ganking threat. Initiate on isolated heroes and force teamfights where you can protect your team.",
      "late": "Become an unkillable frontline force. Your job is to keep your cores alive with shields and your ultimate while applying pressure."
    }
  },
  {
    "heroId": "alchemist",
    "mood": "aggressive",
    "items": [
      {
        "id": "phase_boots",
        "name": "Phase Boots",
        "cost": 1500,
        "phase": "Early",
        "priority": "Core",
        "description": "Mobility and damage to help you farm and chase with your stun."
      },
      {
        "id": "radiance",
        "name": "Radiance",
        "cost": 5150,
        "phase": "Early",
        "priority": "Core",
        "description": "Massively accelerates your farm and provides teamfight presence."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows you to initiate with a fully charged Concoction."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Ensures you can stay in fights and deal damage during Chemical Rage."
      },
      {
        "id": "assault",
        "name": "Assault Cuirass",
        "cost": 5125,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Maximizes your physical damage and makes you tankier."
      },
      {
        "id": "abyssal_blade",
        "name": "Abyssal Blade",
        "cost": 6250,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Provides lockdown to kill elusive heroes."
      }
    ],
    "playstyle": {
      "dos": [
        "Prioritize farming above all else in the early game.",
        "Stack jungle camps for yourself to clear with Acid Spray.",
        "Communicate your item timings to your team.",
        "Use Unstable Concoction to gank or escape.",
        "Give Aghanim's Scepters to your allies in the late game."
      ],
      "donts": [
        "Don't fight without Chemical Rage available.",
        "Don't get caught out of position while farming.",
        "Don't let your Unstable Concoction explode on yourself.",
        "Don't delay your core items for fighting.",
        "Don't forget to farm bounty runes."
      ],
      "tips": [
        "You can start charging Unstable Concoction and then Blink onto a target.",
        "Acid Spray reduces armor, making targets die faster to physical damage.",
        "Greevil's Greed works on bounty runes, making them a high priority.",
        "Once you have Radiance, you can farm two jungle camps at once with Acid Spray.",
        "Your goal is to farm faster than anyone else in the game."
      ]
    },
    "gameplan": {
      "early": "Farm, farm, and farm. Your only goal is to get Radiance as fast as humanly possible. Use Acid Spray to clear creep waves and jungle stacks.",
      "mid": "Once you have Radiance and BKB/Blink, your power spikes. Force fights with Chemical Rage and your stun. Take objectives and control the map with your massive gold lead.",
      "late": "You should be 6-slotted far before anyone else. Use your gold advantage to give Scepters to your teammates and end the game before enemy carries can catch up."
    }
  },
  {
    "heroId": "ancient_apparition",
    "mood": "experimental",
    "items": [
      {
        "id": "tranquil_boots",
        "name": "Tranquil Boots",
        "cost": 1000,
        "phase": "Early",
        "priority": "Core",
        "description": "Mana and health regeneration to sustain you in lane."
      },
      {
        "id": "magic_wand",
        "name": "Magic Wand",
        "cost": 450,
        "phase": "Early",
        "priority": "Core",
        "description": "Essential burst heal and mana in a teamfight."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Makes Ice Vortex a massive magic damage amplifier and slow."
      },
      {
        "id": "force_staff",
        "name": "Force Staff",
        "cost": 2200,
        "phase": "Mid",
        "priority": "Situational",
        "description": "Good for positioning yourself and saving allies."
      },
      {
        "id": "shivas_guard",
        "name": "Shiva's Guard",
        "cost": 4850,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Powerful AoE slow and nuke that synergizes with your spells."
      },
      {
        "id": "octarine_core",
        "name": "Octarine Core",
        "cost": 5275,
        "phase": "Late",
        "priority": "Luxury",
        "description": "More spells, more impact. Reduces the cooldown of your global ultimate."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Ice Blast globally to assist fights you can't attend.",
        "Cast Chilling Touch on your allies before a fight begins.",
        "Place Ice Vortex in choke points and high-traffic areas.",
        "Communicate with your team when you are using your ultimate.",
        "Stay in the backlines and position safely."
      ],
      "donts": [
        "Don't use Ice Blast for farming; it's too valuable.",
        "Don't get caught out of position; you are very fragile.",
        "Don't forget that Ice Blast prevents all healing.",
        "Don't hold your ultimate for the 'perfect' shot; using it is often better.",
        "Don't neglect vision; your global presence relies on it."
      ],
      "tips": [
        "Ice Blast's shatter threshold instantly kills heroes below a certain HP percentage.",
        "You can cast the first part of Ice Blast from the fountain and then teleport to a lane.",
        "Chilling Touch adds a significant amount of magic damage to your team's attacks.",
        "Aghanim's Scepter turns Ice Vortex into one of the best magic resistance reduction spells.",
        "Aghanim's Shard on this hero is one of the best in the game."
      ]
    },
    "gameplan": {
      "early": "Harass in lane with Chilling Touch and Cold Feet. Focus on getting levels and look for opportunities across the map to use Ice Blast.",
      "mid": "Play with your team. Your spells are powerful in teamfights. A well-placed Ice Blast can completely turn a fight by negating healing from the enemy.",
      "late": "You are a global threat. Position safely, provide vision, and use your ultimate to pick off low-health heroes or initiate massive teamfights. Aghanim's Scepter makes you a huge damage amplifier."
    }
  },
  {
    "heroId": "antimage",
    "mood": "experimental",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Attack speed and stat-switching for efficient farming."
      },
      {
        "id": "battle_fury",
        "name": "Battle Fury",
        "cost": 4100,
        "phase": "Early",
        "priority": "Core",
        "description": "The key to your farming speed. Get this as fast as possible."
      },
      {
        "id": "manta",
        "name": "Manta Style",
        "cost": 4600,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows you to farm faster, push lanes, and dispel silences."
      },
      {
        "id": "abyssal_blade",
        "name": "Abyssal Blade",
        "cost": 6250,
        "phase": "Mid",
        "priority": "Core",
        "description": "Gives you lockdown to kill any hero on the map."
      },
      {
        "id": "butterfly",
        "name": "Butterfly",
        "cost": 4975,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Massive boost to damage, attack speed, and evasion."
      },
      {
        "id": "satanic",
        "name": "Satanic",
        "cost": 5050,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Provides survivability and a strong dispel in late-game fights."
      }
    ],
    "playstyle": {
      "dos": [
        "Focus on last hitting and getting your Battle Fury.",
        "Split push lanes to create pressure and farm.",
        "Use Blink to farm faster and more safely than any other hero.",
        "Identify and jump on high-intelligence, low-HP heroes.",
        "Use Mana Void on targets that have just used their spells."
      ],
      "donts": [
        "Don't fight with your team before you have at least Battle Fury and Manta.",
        "Don't blink into a fight without vision.",
        "Don't try to man-fight other carries early in the game.",
        "Don't stop farming; always be hitting creeps.",
        "Don't forget to tread-switch to maximize mana and HP."
      ],
      "tips": [
        "You can use Manta Style to dodge projectiles and remove debuffs.",
        "Blinking into trees can be a safe way to teleport home.",
        "Mana Break works on illusions, making you strong against illusion heroes.",
        "Mana Void deals AoE damage, so try to hit multiple enemies.",
        "Aghanim's Shard is a great pickup for countering specific heroes."
      ]
    },
    "gameplan": {
      "early": "Survive the lane. Your goal is singular: get Battle Fury. Avoid fighting and focus every ounce of your effort on farming creeps.",
      "mid": "Once you have Battle Fury and Manta, you are a machine. Split push relentlessly. Force enemies to respond to you, creating space for your team. Only join fights you know you can win.",
      "late": "With Abyssal Blade and other luxury items, you are one of the strongest heroes in the game. You can now initiate on key targets and end the game."
    }
  },
  {
    "heroId": "arc_warden",
    "mood": "creative",
    "items": [
      {
        "id": "maelstrom",
        "name": "Maelstrom",
        "cost": 2700,
        "phase": "Early",
        "priority": "Core",
        "description": "Your primary farming and wave-clearing tool."
      },
      {
        "id": "boots_of_travel",
        "name": "Boots of Travel",
        "cost": 2500,
        "phase": "Early",
        "priority": "Core",
        "description": "Global presence for you and your Tempest Double."
      },
      {
        "id": "mjollnir",
        "name": "Mjolnir",
        "cost": 5600,
        "phase": "Mid",
        "priority": "Core",
        "description": "Significant upgrade to your damage and farm speed."
      },
      {
        "id": "scythe_of_vyse",
        "name": "Scythe of Vyse",
        "cost": 5675,
        "phase": "Mid",
        "priority": "Core",
        "description": "Unmatched lockdown, usable by both you and your double."
      },
      {
        "id": "daedalus",
        "name": "Daedalus",
        "cost": 5150,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Massive physical damage burst."
      },
      {
        "id": "bloodthorn",
        "name": "Bloodthorn",
        "cost": 6800,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Combines silence, crit, and true strike into one slot."
      }
    ],
    "playstyle": {
      "dos": [
        "Use your Tempest Double to farm lanes and jungle simultaneously.",
        "Place Spark Wraiths in key locations for vision and damage.",
        "Use your double to safely push high ground.",
        "Stay far back in fights, letting your double do the dangerous work.",
        "Micro-manage your double to use items like Scythe of Vyse."
      ],
      "donts": [
        "Don't let your main hero get caught; if you die, the double dies.",
        "Don't stand still; always be farming or applying pressure somewhere.",
        "Don't forget to use Magnetic Field to protect towers or allies.",
        "Don't use your double's Midas if you have one on your main hero (shared cooldown).",
        "Don't neglect your main hero's farm."
      ],
      "tips": [
        "The Tempest Double can use all of your items and most of your spells.",
        "You can use Boots of Travel on your double to push two lanes at once.",
        "Magnetic Field provides 100% evasion to allies and buildings inside it.",
        "Spark Wraiths provide a small amount of vision.",
        "You can 'rat' the enemy base from the safety of your own fountain with a double and Boots of Travel."
      ]
    },
    "gameplan": {
      "early": "Focus on farming your Maelstrom and Boots of Travel. Use your double to secure runes and harass the enemy mid laner.",
      "mid": "Become a global menace. Push out lanes with your double while your main hero farms safely. Join fights from a distance using your double's items and spells.",
      "late": "You are a siege engine. Use your double to relentlessly chip away at enemy buildings. In teamfights, two Scythes of Vyse and two Mjolnirs can be devastating."
    }
  },
  {
    "heroId": "axe",
    "mood": "aggressive",
    "items": [
      {
        "id": "phase_boots",
        "name": "Phase Boots",
        "cost": 1500,
        "phase": "Early",
        "priority": "Core",
        "description": "Armor and a speed boost to get on top of enemies for Berserker's Call."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Early",
        "priority": "Core",
        "description": "Your primary initiation tool. Non-negotiable."
      },
      {
        "id": "blade_mail",
        "name": "Blade Mail",
        "cost": 2100,
        "phase": "Mid",
        "priority": "Core",
        "description": "Punishes enemies for attacking you during Berserker's Call."
      },
      {
        "id": "vanguard",
        "name": "Vanguard",
        "cost": 1700,
        "phase": "Mid",
        "priority": "Situational",
        "description": "Excellent against physical damage lineups for cutting waves."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Late",
        "priority": "Core",
        "description": "Ensures you can't be disabled after blinking in."
      },
      {
        "id": "shivas_guard",
        "name": "Shiva's Guard",
        "cost": 4850,
        "phase": "Late",
        "priority": "Luxury",
        "description": "More armor and a powerful active slow to keep enemies close."
      }
    ],
    "playstyle": {
      "dos": [
        "Initiate fights by blinking in and using Berserker's Call on key targets.",
        "Cut creep waves behind the enemy tower to pressure the lane.",
        "Use Culling Blade to execute low-HP heroes.",
        "Stack jungle camps and clear them with Counter Helix.",
        "Communicate your Blink timing to your team."
      ],
      "donts": [
        "Don't blink into five enemies alone unless your team can follow up.",
        "Don't be afraid to use Culling Blade on a creep for the speed boost.",
        "Don't neglect farming your Blink Dagger.",
        "Don't try to cut waves against heroes that can easily kill you.",
        "Don't forget that Blade Mail returns damage before reductions."
      ],
      "tips": [
        "Berserker's Call forces enemies to attack you, drawing aggro off your carries.",
        "Counter Helix procs are pure chance; play the odds.",
        "A successful Culling Blade gives a temporary speed and attack speed boost to nearby allies.",
        "Berserker's Call pierces spell immunity.",
        "Aghanim's Shard is a strong pickup, applying Battle Hunger to all called units."
      ]
    },
    "gameplan": {
      "early": "Dominate your lane. Pull enemy creeps between their towers to get solo XP and farm. Harass the enemy carry and try to get an early kill. Rush Blink Dagger.",
      "mid": "With Blink Dagger, you are the game's tempo setter. Look for pickoffs on any hero showing in a lane. Force teamfights that are advantageous for your team.",
      "late": "Your role is to initiate and control the enemy's most dangerous core. A good Berserker's Call on a hero like Sniper or Drow Ranger can win the game."
    }
  },
  {
    "heroId": "bane",
    "mood": "chaos",
    "items": [
      {
        "id": "arcane_boots",
        "name": "Arcane Boots",
        "cost": 1300,
        "phase": "Early",
        "priority": "Core",
        "description": "Provides essential mana for you and your laning partner."
      },
      {
        "id": "glimmer_cape",
        "name": "Glimmer Cape",
        "cost": 1950,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows you to channel Fiend's Grip safely or save an ally."
      },
      {
        "id": "aether_lens",
        "name": "Aether Lens",
        "cost": 2275,
        "phase": "Mid",
        "priority": "Core",
        "description": "Increases your cast range, keeping you safe while disabling enemies."
      },
      {
        "id": "force_staff",
        "name": "Force Staff",
        "cost": 2200,
        "phase": "Mid",
        "priority": "Situational",
        "description": "Another tool for positioning and saving allies."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Makes Fiend's Grip create illusions that attack the target."
      },
      {
        "id": "aeon_disk",
        "name": "Aeon Disk",
        "cost": 3000,
        "phase": "Late",
        "priority": "Situational",
        "description": "Guarantees you won't be bursted before you can use your spells."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Fiend's Grip on the most important enemy hero in a fight.",
        "Use Nightmare to set up kills or save an ally.",
        "Sap the enemy's damage with Enfeeble in lane.",
        "Communicate your Fiend's Grip target to your team.",
        "Stay in the back and use your long cast range."
      ],
      "donts": [
        "Don't get caught out of position; you are a prime target.",
        "Don't use Fiend's Grip on a target with Linken's Sphere or an ally who can break it.",
        "Don't forget you can attack a Nightmared ally to wake them up without taking damage.",
        "Don't expose yourself while channeling your ultimate.",
        "Don't try to be a damage dealer; you are a pure controller."
      ],
      "tips": [
        "Brain Sap deals pure damage and heals you, making it great for trading.",
        "You can Nightmare an ally to save them from a projectile or allow them to reposition.",
        "Fiend's Grip disables a hero for a very long time, making it one of the best single-target lockdowns.",
        "Aghanim's Shard makes Brain Sap apply to a second target, greatly increasing survivability.",
        "Nightmare can be transferred to a nearby enemy if the initial target is attacked."
      ]
    },
    "gameplan": {
      "early": "Be a menace in lane. Use Enfeeble and Brain Sap to make the enemy offlaner's life miserable. Set up kills for your carry with Nightmare.",
      "mid": "With your ultimate, any gank becomes a guaranteed kill. Play with your team, find pickoffs, and use Fiend's Grip to win teamfights.",
      "late": "Positioning is everything. Stay far back, use Aether Lens and Glimmer Cape, and disable the enemy's most fed core. A successful ultimate on the right target wins the fight."
    }
  },
  {
    "heroId": "batrider",
    "mood": "chaos",
    "items": [
      {
        "id": "boots_of_travel",
        "name": "Boots of Travel",
        "cost": 2500,
        "phase": "Early",
        "priority": "Core",
        "description": "Global mobility to apply pressure everywhere."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Early",
        "priority": "Core",
        "description": "Essential for getting in position to use Flaming Lasso."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Prevents you from being stunned while dragging an enemy with Lasso."
      },
      {
        "id": "force_staff",
        "name": "Force Staff",
        "cost": 2200,
        "phase": "Mid",
        "priority": "Situational",
        "description": "Allows you to drag enemies even further into your team."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Lassoes a second target, providing immense teamfight control."
      },
      {
        "id": "shivas_guard",
        "name": "Shiva's Guard",
        "cost": 4850,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Provides armor and a strong slow to keep enemies from escaping."
      }
    ],
    "playstyle": {
      "dos": [
        "Stack Sticky Napalm on enemies before committing to a kill.",
        "Use Firefly to farm jungle camps and gain flying vision.",
        "Initiate on key, isolated targets with Flaming Lasso.",
        "Communicate your Lasso target to your team so they can follow up.",
        "Use your mobility to split push and create map pressure."
      ],
      "donts": [
        "Don't try to Lasso a target without a few stacks of Napalm on them.",
        "Don't break your Lasso by moving too far away from the target.",
        "Don't initiate without your team nearby to kill the Lassoed target.",
        "Don't neglect farming your core items (Blink, BKB).",
        "Don't forget Firefly destroys trees, which can be used to escape."
      ],
      "tips": [
        "Sticky Napalm's slow and turn rate reduction stack.",
        "You can use items like Force Staff while channeling Flaming Lasso.",
        "Firefly gives you flying movement, allowing you to move over cliffs and trees.",
        "A successful Lasso is often a guaranteed kill.",
        "Aghanim's Shard is very strong, giving Flamebreak a second charge and knockback."
      ]
    },
    "gameplan": {
      "early": "Dominate your lane with Sticky Napalm. Harass the enemy constantly and build up stacks for a kill attempt with Flamebreak. Farm your Blink Dagger.",
      "mid": "You are the primary initiator. With Blink and BKB, find a key target, Lasso them, and drag them into your team. This creates a 5v4 advantage and lets you take objectives.",
      "late": "Your role remains the same, but targets are more dangerous. An Aghanim's Scepter can be game-winning by taking two heroes out of a fight. Focus on catching cores out of position."
    }
  },
  {
    "heroId": "beastmaster",
    "mood": "aggressive",
    "items": [
      {
        "id": "helm_of_the_overlord",
        "name": "Helm of the Overlord",
        "cost": 6175,
        "phase": "Early",
        "priority": "Core",
        "description": "Creates a powerful army for pushing and fighting."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Removes the cooldown on Wild Axes, providing immense damage."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows you to stand your ground and throw axes in fights."
      },
      {
        "id": "assault",
        "name": "Assault Cuirass",
        "cost": 5125,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Buffs your entire army's armor and attack speed."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Situational",
        "priority": "Situational",
        "description": "For better positioning to land a key Primal Roar."
      },
      {
        "id": "refresher_orb",
        "name": "Refresher Orb",
        "cost": 5000,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Double Primal Roar and a second army can end the game."
      }
    ],
    "playstyle": {
      "dos": [
        "Use your Boar to scout and slow enemies.",
        "Stack Wild Axes to quickly burst down heroes.",
        "Use Primal Roar on a high-priority target to start a fight.",
        "Push towers with your summoned units whenever possible.",
        "Use your Hawk for vision over key areas like Roshan."
      ],
      "donts": [
        "Don't let your summons be picked off for free gold.",
        "Don't waste Primal Roar on a support if a core is available.",
        "Don't neglect controlling your units; they are a major part of your strength.",
        "Don't stand in the frontline without BKB.",
        "Don't forget your aura benefits your entire team."
      ],
      "tips": [
        "Wild Axes damage amplifies from all sources, not just your own.",
        "Primal Roar is a BKB-piercing stun.",
        "You can control the Hawk to provide vision in teamfights.",
        "Helm of the Overlord allows you to dominate a strong neutral creep, adding to your army.",
        "With Agh's Scepter, you can throw axes non-stop, melting heroes and buildings."
      ]
    },
    "gameplan": {
      "early": "Use your Boar to dominate the lane. Secure last hits and harass the enemy. Your goal is to get Helm of the Overlord and start pushing towers.",
      "mid": "With Aghanim's Scepter, your damage output is immense. Group up with your team, use Primal Roar to get a pickoff, then take objectives with your army and axes.",
      "late": "You are a siege monster. Your job is to enable your team to take high ground. A double Primal Roar with Refresher can completely disable the enemy team."
    }
  },
  {
    "heroId": "bloodseeker",
    "mood": "aggressive",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Attack speed and stats."
      },
      {
        "id": "maelstrom",
        "name": "Maelstrom",
        "cost": 2700,
        "phase": "Early",
        "priority": "Core",
        "description": "Accelerates your farm and provides magic damage burst."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Essential for running at enemies without being disabled."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Gives you a second charge of Blood Rite, a massive teamfight spell."
      },
      {
        "id": "butterfly",
        "name": "Butterfly",
        "cost": 4975,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Evasion, attack speed, and damage."
      },
      {
        "id": "abyssal_blade",
        "name": "Abyssal Blade",
        "cost": 6250,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Lockdown for heroes who might try to teleport away from Rupture."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Thirst to identify and hunt down low-HP enemies.",
        "Cast Rupture on mobile heroes to force them to stand still.",
        "Use Blood Rite to silence and damage enemies in an area.",
        "Be aggressive when enemies are low, as Thirst gives you immense speed and damage.",
        "Use Bloodrage on yourself before a fight or on an ally who deals high damage."
      ],
      "donts": [
        "Don't use Rupture on a hero who doesn't need to move (like Sniper).",
        "Don't overextend just because you see a low-HP hero across the map.",
        "Don't forget that Bloodrage amplifies all damage, including damage you take.",
        "Don't fight without BKB against heavy-disable lineups.",
        "Don't be afraid to use Rupture defensively on an enemy chasing you."
      ],
      "tips": [
        "Thirst provides vision of low-HP heroes, even if they are invisible.",
        "Rupture deals pure damage, ignoring armor and magic resistance.",
        "You can cast Bloodrage on allies to amplify their spell damage.",
        "Blood Rite's silence is very effective against spell-casters.",
        "Aghanim's Scepter with two Blood Rite charges is devastating in teamfights."
      ]
    },
    "gameplan": {
      "early": "Focus on farming and controlling the lane. Use Bloodrage for easier last-hitting and denies. Once you hit level 6, look for a gank with Rupture.",
      "mid": "With BKB, you can be a formidable teamfighter. Use Rupture on a key target and run them down. Your ability to clean up fights with Thirst is unparalleled.",
      "late": "Become a true carry. Your job is to kill the backline. Use your speed from Thirst to weave in and out of fights, picking off vulnerable targets."
    }
  },
  {
    "heroId": "bounty_hunter",
    "mood": "chaos",
    "items": [
      {
        "id": "phase_boots",
        "name": "Phase Boots",
        "cost": 1500,
        "phase": "Early",
        "priority": "Core",
        "description": "Damage and mobility to chase down tracked targets."
      },
      {
        "id": "orb_of_corrosion",
        "name": "Orb of Corrosion",
        "cost": 900,
        "phase": "Early",
        "priority": "Core",
        "description": "Early game slow and armor reduction for ganking."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Upgrades Jinada into a powerful bouncing nuke."
      },
      {
        "id": "desolator",
        "name": "Desolator",
        "cost": 3500,
        "phase": "Mid",
        "priority": "Situational",
        "description": "Massive damage boost to one-shot supports."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Late",
        "priority": "Core",
        "description": "Allows you to get your damage off without being disabled."
      },
      {
        "id": "monkey_king_bar",
        "name": "Monkey King Bar",
        "cost": 4900,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Deals with evasion and provides more damage."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Track on every possible enemy hero in a fight.",
        "Roam the map looking for ganks on vulnerable heroes.",
        "Provide vision for your team with Track.",
        "Use Shadow Walk to scout and position for kills.",
        "Steal gold with Jinada from enemy heroes."
      ],
      "donts": [
        "Don't show yourself in lane unnecessarily; stay hidden.",
        "Don't try to be a frontline carry; you are a skirmisher.",
        "Don't forget that Track gives vision and bonus gold to your whole team.",
        "Don't waste Track on a hero that is about to die anyway.",
        "Don't walk around without mana for Shadow Walk."
      ],
      "tips": [
        "Track provides True Sight over the target.",
        "Jinada's cooldown is independent of your attack speed; use it as soon as it's ready.",
        "Aghanim's Scepter allows Jinada to hit multiple tracked enemies, which is huge in teamfights.",
        "You can use Shuriken Toss to interrupt channeling spells.",
        "The bonus gold from Track can give your team a massive economic advantage."
      ]
    },
    "gameplan": {
      "early": "Play as a roamer. Gank mid, gank the safe lane, create chaos. Your goal is to disrupt the enemy's laning stage and get your team ahead with Track gold.",
      "mid": "With Aghanim's, you become a potent teamfighter. Stay on the edge of the fight, cast Track on everyone, and use your bouncing Jinada to deal massive damage.",
      "late": "Your role is to provide vision with Track and burst down key support heroes. A well-placed Track can reveal an enemy carry trying to hide, winning you the game."
    }
  },
  {
    "heroId": "brewmaster",
    "mood": "chaos",
    "items": [
      {
        "id": "phase_boots",
        "name": "Phase Boots",
        "cost": 1500,
        "phase": "Early",
        "priority": "Core",
        "description": "Armor and mobility."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Early",
        "priority": "Core",
        "description": "Your most important item. Allows you to fight inside and outside your ultimate."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Mid",
        "priority": "Core",
        "description": "Positioning to clap and split on key targets."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows you to get your full combo off."
      },
      {
        "id": "refresher_orb",
        "name": "Refresher Orb",
        "cost": 5000,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Double Primal Split is one of the strongest late-game abilities."
      },
      {
        "id": "assault",
        "name": "Assault Cuirass",
        "cost": 5125,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Makes you and your spirits tankier and hit harder."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Primal Split to turn fights and become a huge threat.",
        "Learn to micro your three spirits effectively.",
        "Use Thunderous Clap to slow and damage enemies.",
        "Use Drunken Brawler's evasion and critical strike to your advantage.",
        "Initiate fights with Blink and your clap/split combo."
      ],
      "donts": [
        "Don't die before you can use Primal Split.",
        "Don't forget to use the abilities of your spirits (Cyclone, Dispel, Stun).",
        "Don't try to man-fight without your ultimate up.",
        "Don't use Primal Split just to save yourself if the fight is already lost.",
        "Don't neglect farming your Aghanim's Scepter."
      ],
      "tips": [
        "The Storm spirit can Cyclone a key enemy, taking them out of the fight.",
        "The Earth spirit has a long-duration stun.",
        "The Fire spirit deals significant damage over time.",
        "With Aghanim's, you can cast spells and continue fighting even while split.",
        "Aghanim's Shard is incredibly powerful, granting you a second Cinder Brew charge and making Drunken Brawler an active."
      ]
    },
    "gameplan": {
      "early": "Survive and farm. Your goal is Aghanim's Scepter. Use your spells to secure last hits and harass. You are not a strong laner until you get a few levels.",
      "mid": "Once you have Agh's and Blink, you are a monster. Initiate on a key target, use Primal Split, and wreak havoc. Your ultimate is a free teamfight win if used correctly.",
      "late": "Become the ultimate controller. A Refresher Orb allows for two Primal Splits, which is almost impossible for an enemy team to deal with. Your job is to disable and chaos."
    }
  },
  {
    "heroId": "bristleback",
    "mood": "aggressive",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Stats and attack speed."
      },
      {
        "id": "vanguard",
        "name": "Vanguard",
        "cost": 1700,
        "phase": "Early",
        "priority": "Core",
        "description": "Makes you incredibly tanky in the early game."
      },
      {
        "id": "bloodstone",
        "name": "Bloodstone",
        "cost": 4400,
        "phase": "Mid",
        "priority": "Core",
        "description": "Massive mana regeneration to spam your spells."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Makes Quill Spray an AoE Viscous Nasal Goo, a huge power spike."
      },
      {
        "id": "shivas_guard",
        "name": "Shiva's Guard",
        "cost": 4850,
        "phase": "Late",
        "priority": "Luxury",
        "description": "More armor, intelligence, and a powerful slow."
      },
      {
        "id": "heart",
        "name": "Heart of Tarrasque",
        "cost": 5000,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Makes you nearly unkillable if the enemy lacks breaks."
      }
    ],
    "playstyle": {
      "dos": [
        "Spam Quill Spray to stack damage on enemies.",
        "Always face your back towards the enemy to take less damage.",
        "Run at enemies to apply Viscous Nasal Goo.",
        "Be the frontline for your team, absorbing damage and spells.",
        "Dive towers to secure kills once you are tanky."
      ],
      "donts": [
        "Don't face enemies head-on in fights; show them your back.",
        "Don't be afraid to be aggressive, but know your limits.",
        "Don't get broken by heroes with Silver Edge or other breaks.",
        "Don't run out of mana; manage your spell casting.",
        "Don't build pure damage items; your damage comes from spell spam."
      ],
      "tips": [
        "Each stack of Warpath increases your movement speed and damage.",
        "Quill Spray damage is physical and stacks infinitely.",
        "Viscous Nasal Goo reduces armor and slows, making targets easy to kill.",
        "Aghanim's Scepter turns you into a walking armor-shredding machine.",
        "Buy a Lotus Orb if the enemy has a lot of single-target spells."
      ]
    },
    "gameplan": {
      "early": "Dominate your lane. Spam Quill Spray and run down the enemy heroes. You are one of the strongest laners in the game. Farm your Vanguard and start snowballing.",
      "mid": "With Bloodstone and Agh's, you are a menace. You can run at the entire enemy team. Force fights, take towers, and create space for your carries.",
      "late": "You are the unkillable frontline. Your job is to soak up as much damage and attention as possible while your team cleans up. Be wary of heroes with break mechanics."
    }
  },
  {
    "heroId": "broodmother",
    "mood": "experimental",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Stats and attack speed for you and your spiderlings."
      },
      {
        "id": "orchid",
        "name": "Orchid Malevolence",
        "cost": 3475,
        "phase": "Early",
        "priority": "Core",
        "description": "Silence to kill elusive heroes and mana regeneration."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows you to fight without your spiders being instantly cleared by magic."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Massively increases your web count and mobility."
      },
      {
        "id": "assault",
        "name": "Assault Cuirass",
        "cost": 5125,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Buffs your spider army and makes you tankier."
      },
      {
        "id": "bloodthorn",
        "name": "Bloodthorn",
        "cost": 6800,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Upgrade to Orchid that adds critical strike and true strike."
      }
    ],
    "playstyle": {
      "dos": [
        "Take over the enemy jungle and one lane with your webs.",
        "Push towers with your spider army.",
        "Control your spiderlings to farm multiple camps at once.",
        "Hunt down and kill isolated support heroes.",
        "Use your webs to escape over cliffs and through trees."
      ],
      "donts": [
        "Don't pick Broodmother against heavy AoE magic damage (like Earthshaker).",
        "Don't let your spider army get wiped out for a lot of gold.",
        "Don't fight outside of your webs if you can avoid it.",
        "Don't group all your spiders together.",
        "Don't forget to micro your different spiderling groups."
      ],
      "tips": [
        "Spin Web gives you free pathing, health regen, and movement speed.",
        "You can place webs in a chain to control a large portion of the map.",
        "Insatiable Hunger gives you massive lifesteal and damage.",
        "Aghanim's Scepter removes the web limit and increases your speed bonus.",
        "Use different control groups for your hero and your spiders."
      ]
    },
    "gameplan": {
      "early": "Win your lane, hard. Create a web network, spawn spiders, and kill the enemy hero repeatedly. Take their tower and invade their jungle.",
      "mid": "You are a map-control monster. Choke the enemy out of their own side of the map. Force rotations to deal with you, creating space for the rest of your team.",
      "late": "Your role shifts to a semi-carry. You can still split push, but with BKB and Bloodthorn, you can also join teamfights and burst down key targets."
    }
  },
  {
    "heroId": "centaur_warrunner",
    "mood": "aggressive",
    "items": [
      {
        "id": "phase_boots",
        "name": "Phase Boots",
        "cost": 1500,
        "phase": "Early",
        "priority": "Core",
        "description": "Armor and mobility to get in position."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Early",
        "priority": "Core",
        "description": "Essential for initiating with Hoof Stomp."
      },
      {
        "id": "blade_mail",
        "name": "Blade Mail",
        "cost": 2100,
        "phase": "Mid",
        "priority": "Core",
        "description": "Punishes enemies for focusing you after you blink in."
      },
      {
        "id": "heart",
        "name": "Heart of Tarrasque",
        "cost": 5000,
        "phase": "Mid",
        "priority": "Core",
        "description": "Massive strength gain, which directly translates to damage for you."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Makes Stampede reduce damage for your team and go over cliffs."
      },
      {
        "id": "shivas_guard",
        "name": "Shiva's Guard",
        "cost": 4850,
        "phase": "Late",
        "priority": "Luxury",
        "description": "More armor and a strong slow for teamfights."
      }
    ],
    "playstyle": {
      "dos": [
        "Initiate fights with Blink into Hoof Stomp.",
        "Use Stampede to save your team or initiate a fight from anywhere on the map.",
        "Use Double Edge to secure kills or farm waves.",
        "Build as much strength as possible to increase your damage.",
        "Be the frontline and soak up damage."
      ],
      "donts": [
        "Don't use Stampede when your team is not ready to fight.",
        "Don't neglect farming your Blink Dagger.",
        "Don't be afraid to use Double Edge, even though it damages you.",
        "Don't blink in without your team to follow up.",
        "Don't forget Retaliate damages towers."
      ],
      "tips": [
        "Retaliate scales with your strength, making Heart of Tarrasque a damage item.",
        "Stampede makes your entire team unstoppable and slows enemies they run through.",
        "A well-timed Stampede can help your entire team escape a gank.",
        "Double Edge's damage is based on your strength.",
        "Aghanim's Shard is a must-buy, giving Double Edge a slow and strength bonus."
      ]
    },
    "gameplan": {
      "early": "Dominate your lane with your high base damage and Double Edge. Harass the enemy carry and farm your Blink Dagger as quickly as possible.",
      "mid": "You are the primary initiator. Look for opportunities to Blink-Stomp and get kills. Use Stampede to rotate your team around the map for ganks and objectives.",
      "late": "Become an unkillable raid boss with Heart. Your job is to blink in, cause as much chaos as possible, and allow your carries to clean up."
    }
  },
  {
    "heroId": "chaos_knight",
    "mood": "chaos",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Stats and attack speed for you and your illusions."
      },
      {
        "id": "armlet_of_mordiggian",
        "name": "Armlet of Mordiggian",
        "cost": 2370,
        "phase": "Early",
        "priority": "Core",
        "description": "Huge damage and survivability boost, especially for your illusions."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows you to get your damage off without being kited or disabled."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows you to cast Phantasm on an ally and reduces the cooldown."
      },
      {
        "id": "assault",
        "name": "Assault Cuirass",
        "cost": 5125,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Armor reduction and attack speed for your whole illusion army."
      },
      {
        "id": "heart",
        "name": "Heart of Tarrasque",
        "cost": 5000,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Makes you and your illusions incredibly tanky."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Chaos Bolt to stun and set up kills.",
        "Use Reality Rift to pull enemies closer and get bonus damage.",
        "Use Phantasm before a fight to maximize your damage output.",
        "Focus on bursting down a single target with your illusions.",
        "Learn to 'Armlet toggle' to survive fights."
      ],
      "donts": [
        "Don't get caught without Phantasm ready for a fight.",
        "Don't pick Chaos Knight against heavy AoE clear like Sven or Earthshaker.",
        "Don't forget your illusions benefit from your stats, not +damage items.",
        "Don't waste Reality Rift on an enemy you can't kill.",
        "Don't let your Chaos Bolt's random duration frustrate you."
      ],
      "tips": [
        "Reality Rift reduces the target's armor.",
        "Your Phantasm illusions deal 100% damage, making them the strongest in the game.",
        "Chaos Strike is a guaranteed critical strike after a cooldown, not random.",
        "With Agh's, you can use Phantasm on an allied carry to give them a massive damage boost.",
        "Build strength items to make your illusions hit harder and last longer."
      ]
    },
    "gameplan": {
      "early": "Focus on farming your Armlet. Use your stun and pull to set up kills with your support. You have high kill potential at level 2-3.",
      "mid": "With Armlet and Phantasm, you are a monster. Find isolated targets and burst them down. Your goal is to snowball from successful ganks.",
      "late": "You are a powerful single-target carry. Identify the most important enemy and eliminate them from the fight with your illusion army. With Agh's, you can also be a massive force multiplier for another core."
    }
  },
  {
    "heroId": "chen",
    "mood": "defensive",
    "items": [
      {
        "id": "arcane_boots",
        "name": "Arcane Boots",
        "cost": 1300,
        "phase": "Early",
        "priority": "Core",
        "description": "Mana for you and your army."
      },
      {
        "id": "mekansm",
        "name": "Mekansm",
        "cost": 1775,
        "phase": "Early",
        "priority": "Core",
        "description": "Early teamfight healing that synergizes with your global."
      },
      {
        "id": "holy_locket",
        "name": "Holy Locket",
        "cost": 2350,
        "phase": "Mid",
        "priority": "Core",
        "description": "Amplifies all your healing, including Hand of God."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows Hand of God to apply strong dispels and heal your Ancients."
      },
      {
        "id": "pipe",
        "name": "Pipe of Insight",
        "cost": 3375,
        "phase": "Late",
        "priority": "Situational",
        "description": "Essential against heavy magic damage lineups."
      },
      {
        "id": "guardian_greaves",
        "name": "Guardian Greaves",
        "cost": 4950,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Combines your boots and Mekansm, providing a dispel on use."
      }
    ],
    "playstyle": {
      "dos": [
        "Dominate the jungle and convert powerful creeps.",
        "Gank lanes early with your army of creeps.",
        "Use Hand of God to save allies across the map.",
        "Push towers with your team and your army.",
        "Learn the abilities of different neutral creeps."
      ],
      "donts": [
        "Don't pick Chen if you are not comfortable with micro-management.",
        "Don't let your converted creeps die for free.",
        "Don't forget to use your creeps' abilities.",
        "Don't use Hand of God if the fight is already lost.",
        "Don't try to be a right-clicker; you are a summoner and healer."
      ],
      "tips": [
        "You can send a converted creep back to base to heal it with Divine Favor.",
        "Hand of God is a global heal that affects all allied heroes and your units.",
        "Aghanim's Scepter lets you convert Ancient creeps, which are incredibly powerful.",
        "Use different control groups for your different creeps.",
        "Penitence slows the enemy and makes them take more attack damage."
      ]
    },
    "gameplan": {
      "early": "Take over the jungle. Get a powerful creep (like a Centaur or Hellbear) and gank a lane at level 2. Your goal is to create immense early game pressure and take towers.",
      "mid": "Group up with your team and push. Your army and Mekansm make you a powerhouse in mid-game teamfights. Use Hand of God to turn skirmishes in your favor.",
      "late": "You are the ultimate support. With Aghanim's, you can save anyone on your team with a strong dispel. Your job is to enable your cores and keep them alive through anything."
    }
  },
  {
    "heroId": "clinkz",
    "mood": "experimental",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Attack speed and stats."
      },
      {
        "id": "maelstrom",
        "name": "Maelstrom",
        "cost": 2700,
        "phase": "Early",
        "priority": "Core",
        "description": "Provides wave clear and magic damage burst."
      },
      {
        "id": "orchid",
        "name": "Orchid Malevolence",
        "cost": 3475,
        "phase": "Mid",
        "priority": "Core",
        "description": "Silence to lock down and kill elusive heroes."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows you to attack freely in teamfights."
      },
      {
        "id": "scythe_of_vyse",
        "name": "Scythe of Vyse",
        "cost": 5675,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Hard lockdown for key targets."
      },
      {
        "id": "daedalus",
        "name": "Daedalus",
        "cost": 5150,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Massive physical damage boost."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Skeleton Walk to scout and position for ganks.",
        "Use Tar Bomb and Searing Arrows to harass and kill heroes.",
        "Use Burning Barrage to quickly clear creep waves or damage heroes.",
        "Split push and take towers when the enemy is distracted.",
        "Hunt and kill isolated support heroes."
      ],
      "donts": [
        "Don't get caught without mana for Skeleton Walk.",
        "Don't stand and fight without an escape plan.",
        "Don't forget to use Death Pact on a large creep before a fight for bonus HP and damage.",
        "Don't engage into multiple heroes without BKB.",
        "Don't ignore farming."
      ],
      "tips": [
        "Skeleton Walk's bonus speed is great for chasing or escaping.",
        "Burning Barrage procs attack modifiers like Maelstrom and Desolator.",
        "Death Pact is a strong dispel, allowing you to remove certain debuffs.",
        "Aghanim's Shard is amazing, creating two skeletons from Skeleton Walk.",
        "You can attack out of invisibility and immediately re-enter it with Skeleton Walk."
      ]
    },
    "gameplan": {
      "early": "Focus on farming your core items. Use your invisibility to stay safe and find occasional pickoffs on overextended supports.",
      "mid": "With Orchid, you become a terrifying ganker. Find a target, silence them, and burst them down. Apply pressure to towers and force reactions from the enemy.",
      "late": "You are a glass cannon. Your positioning is key. Stay invisible on the edge of fights, wait for the enemy to use their spells, then emerge and eliminate their backline."
    }
  },
  {
    "heroId": "clockwerk",
    "mood": "chaos",
    "items": [
      {
        "id": "phase_boots",
        "name": "Phase Boots",
        "cost": 1500,
        "phase": "Early",
        "priority": "Core",
        "description": "Armor and mobility to get in close."
      },
      {
        "id": "blade_mail",
        "name": "Blade Mail",
        "cost": 2100,
        "phase": "Early",
        "priority": "Core",
        "description": "Punishes enemies for attacking you inside Power Cogs."
      },
      {
        "id": "force_staff",
        "name": "Force Staff",
        "cost": 2200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Can be used to push enemies into cogs or escape."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Massively reduces Hookshot cooldown and stuns allies you pull."
      },
      {
        "id": "shivas_guard",
        "name": "Shiva's Guard",
        "cost": 4850,
        "phase": "Late",
        "priority": "Luxury",
        "description": "More armor and a powerful slow."
      },
      {
        "id": "overwhelming_blink",
        "name": "Overwhelming Blink",
        "cost": 6800,
        "phase": "Late",
        "priority": "Luxury",
        "description": "An upgraded blink that provides a slow and damage on arrival."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Hookshot to initiate on key backline heroes.",
        "Trap enemies with Power Cogs.",
        "Use Rocket Flare for global vision and scouting.",
        "Push enemies around with Cogs to disrupt their positioning.",
        "Be a nuisance and absorb attention in fights."
      ],
      "donts": [
        "Don't hook into five enemies without a plan or backup.",
        "Don't trap your own teammates in Cogs.",
        "Don't forget to use Battery Assault before you hook.",
        "Don't build pure damage items; you are an initiator and disrupter.",
        "Don't waste Rocket Flare; use it to check Roshan or high ground."
      ],
      "tips": [
        "Hookshot stuns the target on impact.",
        "Power Cogs burn mana and knock enemies back.",
        "You can deny your own cogs by attacking them.",
        "Aghanim's Shard is incredible, giving you a powerful short-range stun with Jetpack.",
        "With Agh's Scepter, you can use Hookshot to pull yourself to allies, saving them."
      ]
    },
    "gameplan": {
      "early": "Be a bully in the offlane. Use Battery Assault and Power Cogs to secure kills and make the enemy carry's life difficult. ",
      "mid": "You are the primary initiator. Find pickoffs with Hookshot across the map. Your job is to start fights by catching an enemy hero out of position.",
      "late": "Your role is to disrupt the most important enemy hero. Hook their carry or a key spell-caster like Enigma. With Agh's, you can also play a more defensive, saving role."
    }
  },
  {
    "heroId": "crystal_maiden",
    "mood": "defensive",
    "items": [
      {
        "id": "tranquil_boots",
        "name": "Tranquil Boots",
        "cost": 1000,
        "phase": "Early",
        "priority": "Core",
        "description": "HP regen and movement speed, which you desperately need."
      },
      {
        "id": "glimmer_cape",
        "name": "Glimmer Cape",
        "cost": 1950,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows you to channel your ultimate safely or save an ally."
      },
      {
        "id": "force_staff",
        "name": "Force Staff",
        "cost": 2200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Essential for positioning and saving yourself or allies."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Late",
        "priority": "Situational",
        "description": "Guarantees you can get your ultimate off in a fight."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Applies Frostbite to anyone standing in your ultimate."
      },
      {
        "id": "aeon_disk",
        "name": "Aeon Disk",
        "cost": 3000,
        "phase": "Late",
        "priority": "Situational",
        "description": "Prevents you from being instantly bursted down."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Frostbite to set up kills.",
        "Harass with Crystal Nova in lane.",
        "Provide vision and pull/stack camps.",
        "Position yourself safely in the back of teamfights.",
        "Use Freezing Field in combination with other AoE disables."
      ],
      "donts": [
        "Don't show on the map alone; you are very slow and fragile.",
        "Don't use Freezing Field in the open without Glimmer or BKB.",
        "Don't skill Arcane Aura level 1 unless your team needs it.",
        "Don't stand still; your positioning is your only defense.",
        "Don't waste your mana on farming creeps."
      ],
      "tips": [
        "Arcane Aura provides mana regeneration to your entire team globally.",
        "Frostbite can be used on neutral creeps to farm them easily.",
        "A well-placed Freezing Field can win a teamfight on its own.",
        "Aghanim's Scepter turns your ultimate into a massive teamfight control spell.",
        "Always carry a Town Portal Scroll to join fights or escape."
      ]
    },
    "gameplan": {
      "early": "Dominate the lane with your spells. Your high base damage and nukes make you a strong laner. Get kills for your carry and start roaming if possible.",
      "mid": "Play with your team. Your spells are crucial for teamfights. Find a safe spot to use Freezing Field, ideally after the enemy has used their stuns.",
      "late": "Positioning is everything. Stay far back, use your utility items to save your cores, and look for that game-winning ultimate. One good Freezing Field can decide the match."
    }
  },
  {
    "heroId": "dark_seer",
    "mood": "experimental",
    "items": [
      {
        "id": "arcane_boots",
        "name": "Arcane Boots",
        "cost": 1300,
        "phase": "Early",
        "priority": "Core",
        "description": "Mana to sustain your Ion Shell spam."
      },
      {
        "id": "mekansm",
        "name": "Mekansm",
        "cost": 1775,
        "phase": "Early",
        "priority": "Core",
        "description": "Early game teamfight heal."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Mid",
        "priority": "Core",
        "description": "Essential for positioning your Vacuum and Wall of Replica."
      },
      {
        "id": "shivas_guard",
        "name": "Shiva's Guard",
        "cost": 4850,
        "phase": "Mid",
        "priority": "Core",
        "description": "Intelligence, armor, and a powerful slow that combos with your spells."
      },
      {
        "id": "refresher_orb",
        "name": "Refresher Orb",
        "cost": 5000,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Double Vacuum into double Wall is a game-winning combo."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Makes Wall of Replica illusions stronger and apply a slow."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Ion Shell on a melee creep to push the lane and farm from a safe distance.",
        "Use Surge on yourself or allies to escape or chase.",
        "Land a big Vacuum that pulls multiple enemies into your team.",
        "Use Wall of Replica in combination with Vacuum.",
        "Cut creep waves with Ion Shell."
      ],
      "donts": [
        "Don't get caught out of position; you are not inherently tanky.",
        "Don't use Wall of Replica after the enemy has already used their big spells.",
        "Don't forget to put Ion Shell on your initiator before they go in.",
        "Don't waste Vacuum on a single target unless it's a key kill.",
        "Don't neglect farming your core items."
      ],
      "tips": [
        "Vacuum pulls enemies through spell immunity, but doesn't damage them.",
        "Wall of Replica creates illusions of enemy heroes that pass through it.",
        "A perfect combo is to Blink in, Vacuum enemies together, then place the Wall right on top of them.",
        "Surge provides max movement speed and can be used to help your whole team reposition.",
        "Aghanim's Shard is amazing, giving you a passive that creates an explosion on kills."
      ]
    },
    "gameplan": {
      "early": "Dominate the offlane. Spam Ion Shell on creeps to farm safely and harass the enemy carry. You can easily cut waves and pressure the tower.",
      "mid": "With Mekansm and Blink, you are a teamfight powerhouse. Look for opportunities to land a multi-hero Vacuum. Your combo can win fights on its own.",
      "late": "You are the ultimate wombo-combo hero. A good Blink -> Vacuum -> Wall -> Refresher -> Vacuum -> Wall can single-handedly win the game against the right lineup."
    }
  },
  {
    "heroId": "dark_willow",
    "mood": "chaos",
    "items": [
      {
        "id": "arcane_boots",
        "name": "Arcane Boots",
        "cost": 1300,
        "phase": "Early",
        "priority": "Core",
        "description": "Mana sustain for your spell-heavy kit."
      },
      {
        "id": "aether_lens",
        "name": "Aether Lens",
        "cost": 2275,
        "phase": "Mid",
        "priority": "Core",
        "description": "Increases cast range, allowing you to stay safe."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows you to attack freely during Shadow Realm, a massive power spike."
      },
      {
        "id": "euls_scepter_of_divinity",
        "name": "Eul's Scepter of Divinity",
        "cost": 2625,
        "phase": "Situational",
        "priority": "Situational",
        "description": "A defensive tool to dodge spells and set up your Cursed Crown."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Late",
        "priority": "Luxury",
        "description": "For perfect positioning of your ultimates."
      },
      {
        "id": "scythe_of_vyse",
        "name": "Scythe of Vyse",
        "cost": 5675,
        "phase": "Late",
        "priority": "Luxury",
        "description": "The ultimate lockdown tool."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Shadow Realm to dodge projectiles and deal burst damage.",
        "Set up kills with Cursed Crown into Bramble Maze.",
        "Use your ultimates (Bedlam, Terrorize) to control teamfights.",
        "Stay in the backlines and use your long-range spells.",
        "Provide vision and control with your abilities."
      ],
      "donts": [
        "Don't get caught out of position; you are extremely fragile.",
        "Don't use Bedlam without a way to stay close to your target.",
        "Don't forget Terrorize can be used to force enemies out of position or save an ally.",
        "Don't try to be a right-clicker without Aghanim's Scepter.",
        "Don't waste Shadow Realm; it's your best defensive tool."
      ],
      "tips": [
        "Shadow Realm makes you untargetable.",
        "You can cast other spells and items while in Shadow Realm.",
        "Cursed Crown stuns in an area, so it can catch multiple heroes.",
        "Terrorize forces enemies to run towards their fountain.",
        "With Agh's Scepter, you can attack without breaking Shadow Realm, dealing immense damage."
      ]
    },
    "gameplan": {
      "early": "Harass the enemy with your spells. Look for kill opportunities with your Cursed Crown and Bramble Maze combo. You are a strong laner.",
      "mid": "Transition into a powerful teamfighter. Your ultimates can wreak havoc. With Aghanim's, you also become a significant damage dealer. ",
      "late": "You are a high-impact control and damage hero. Your positioning is paramount. A good Terrorize can split the enemy team and win you the game."
    }
  },
  {
    "heroId": "dawnbreaker",
    "mood": "aggressive",
    "items": [
      {
        "id": "phase_boots",
        "name": "Phase Boots",
        "cost": 1500,
        "phase": "Early",
        "priority": "Core",
        "description": "Armor and mobility to get in position for your hammer."
      },
      {
        "id": "echo_sabre",
        "name": "Echo Sabre",
        "cost": 2500,
        "phase": "Early",
        "priority": "Core",
        "description": "Double attack and mana regen, great synergy with your passive."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows you to get your full combo off and fight freely."
      },
      {
        "id": "desolator",
        "name": "Desolator",
        "cost": 3500,
        "phase": "Mid",
        "priority": "Situational",
        "description": "High damage item that synergizes with your physical damage."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Makes Solar Guardian castable on creeps and provides a pulsing slow/damage."
      },
      {
        "id": "abyssal_blade",
        "name": "Abyssal Blade",
        "cost": 6250,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Provides lockdown to ensure you can kill your targets."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Solar Guardian to join fights from anywhere on the map.",
        "Land your Starbreaker combo for a stun.",
        "Use Celestial Hammer to slow enemies and reposition.",
        "Be the frontline for your team, initiating and soaking damage.",
        "Communicate with your team when your ultimate is ready."
      ],
      "donts": [
        "Don't waste Solar Guardian on a fight that's already lost.",
        "Don't miss the recall on Starbreaker.",
        "Don't fight without your team; you excel at teamfighting.",
        "Don't forget your passive heals nearby allies.",
        "Don't build like a hard carry; you are a tempo-setting brawler."
      ],
      "tips": [
        "Solar Guardian heals allies and damages enemies on each pulse.",
        "You are spell immune while flying back with Starbreaker.",
        "Celestial Hammer leaves a trail of fire that slows and damages enemies.",
        "Your Luminosity passive procs on the third attack, dealing a critical strike and healing allies.",
        "Aghanim's Shard is incredible, giving you magic immunity during Solar Guardian's flight."
      ]
    },
    "gameplan": {
      "early": "Dominate your lane with your high sustain and damage. Use your hammer and stun combo to secure kills. Look for opportunities to use your ultimate on other lanes.",
      "mid": "You are a global ganking machine. With Echo Sabre and BKB, you can join any fight and be a massive threat. Force objectives after successful ultimates.",
      "late": "Transition into a durable frontline core. Your job is to initiate, absorb spells with BKB, and deal sustained damage in teamfights while healing your allies."
    }
  },
  {
    "heroId": "dazzle",
    "mood": "defensive",
    "items": [
      {
        "id": "arcane_boots",
        "name": "Arcane Boots",
        "cost": 1300,
        "phase": "Early",
        "priority": "Core",
        "description": "Mana sustain for you and your team."
      },
      {
        "id": "mekansm",
        "name": "Mekansm",
        "cost": 1775,
        "phase": "Early",
        "priority": "Core",
        "description": "Early game teamfight healing."
      },
      {
        "id": "holy_locket",
        "name": "Holy Locket",
        "cost": 2350,
        "phase": "Mid",
        "priority": "Core",
        "description": "Amplifies your healing and provides stats."
      },
      {
        "id": "glimmer_cape",
        "name": "Glimmer Cape",
        "cost": 1950,
        "phase": "Mid",
        "priority": "Situational",
        "description": "A defensive tool to save yourself or allies."
      },
      {
        "id": "guardian_greaves",
        "name": "Guardian Greaves",
        "cost": 4950,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Combines your boots and Mek, providing a dispel and better stats."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Causes Shadow Wave to dispel allies, a powerful upgrade."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Shallow Grave to save an ally from certain death.",
        "Spam Shadow Wave in lane to heal allies and damage enemies.",
        "Use Poison Touch to slow and harass.",
        "Position yourself safely in the back of fights.",
        "Stack Bad Juju to reduce your cooldowns significantly."
      ],
      "donts": [
        "Don't use Shallow Grave too early or too late.",
        "Don't get caught out of position; you are a primary target.",
        "Don't neglect your armor reduction from Bad Juju.",
        "Don't try to be a damage dealer; you are a defensive support.",
        "Don't waste mana; you need it for key saves."
      ],
      "tips": [
        "Shallow Grave prevents a hero's HP from dropping below 1.",
        "Shadow Wave bounces between allies, healing them and damaging nearby enemies.",
        "Bad Juju reduces the cooldown of all your spells and items every time you cast a spell.",
        "Aghanim's Shard is a must-buy, giving you a hex on your Poison Touch.",
        "You can become a physical damage threat in the very late game by building items like Desolator."
      ]
    },
    "gameplan": {
      "early": "Be a strong lane support. Harass with Poison Touch and use Shadow Wave to trade effectively. Look for opportunities to save your core with a well-timed Shallow Grave.",
      "mid": "Group up with your team. Your ability to sustain your team through fights with heals and saves is immense. Your cooldowns get very low, allowing for multiple spell rotations.",
      "late": "You are the ultimate defensive support. A perfectly timed Shallow Grave on your carry can win the game. With Agh's, you can also dispel key stuns from your team."
    }
  },
  {
    "heroId": "death_prophet",
    "mood": "aggressive",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Stats and attack speed."
      },
      {
        "id": "euls_scepter_of_divinity",
        "name": "Eul's Scepter of Divinity",
        "cost": 2625,
        "phase": "Early",
        "priority": "Core",
        "description": "Mana regen, movement speed, and a defensive tool."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Essential for running at the enemy team with your ultimate."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Causes enemies hit by your spells to run in fear."
      },
      {
        "id": "shivas_guard",
        "name": "Shiva's Guard",
        "cost": 4850,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Armor, intelligence, and a powerful slow."
      },
      {
        "id": "octarine_core",
        "name": "Octarine Core",
        "cost": 5275,
        "phase": "Late",
        "priority": "Luxury",
        "description": "More spells, more lifesteal, more tankiness."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Exorcism to push towers and win teamfights.",
        "Spam Crypt Swarm to farm and harass.",
        "Use Silence to disable key enemy heroes.",
        "Activate your ultimate before a fight starts.",
        "Be the frontline pusher for your team."
      ],
      "donts": [
        "Don't get caught without your ultimate ready for a fight.",
        "Don't stand still; keep moving to maximize your ultimate's damage.",
        "Don't be afraid to use your ultimate to take Roshan.",
        "Don't build right-click damage items.",
        "Don't forget Spirit Siphon heals you."
      ],
      "tips": [
        "Exorcism spirits return to you at the end of the duration, healing you for a percentage of the damage dealt.",
        "You can use Eul's Scepter on yourself to dodge projectiles and spells.",
        "Spirit Siphon drains movement speed and health from enemies, making you very tanky.",
        "Aghanim's Scepter provides immense control in teamfights.",
        "Your goal is to press R, press BKB, and run at the enemy team."
      ]
    },
    "gameplan": {
      "early": "Dominate your lane with Crypt Swarm. You have high kill potential with Spirit Siphon. Farm your core items and prepare to take objectives.",
      "mid": "Once you have your ultimate and BKB, you are a walking death ball. Group up with your team, pop Exorcism, and run down towers and heroes.",
      "late": "You are a formidable teamfighter and sieger. Your job is to break high ground. With Agh's, you also provide a huge amount of control."
    }
  },
  {
    "heroId": "disruptor",
    "mood": "chaos",
    "items": [
      {
        "id": "arcane_boots",
        "name": "Arcane Boots",
        "cost": 1300,
        "phase": "Early",
        "priority": "Core",
        "description": "Mana sustain."
      },
      {
        "id": "glimmer_cape",
        "name": "Glimmer Cape",
        "cost": 1950,
        "phase": "Mid",
        "priority": "Core",
        "description": "A defensive tool to save yourself or allies."
      },
      {
        "id": "force_staff",
        "name": "Force Staff",
        "cost": 2200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Essential for positioning and saving."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Core",
        "description": "Makes Static Storm mute items, a game-winning upgrade."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Late",
        "priority": "Luxury",
        "description": "For perfect positioning of your ultimate combo."
      },
      {
        "id": "refresher_orb",
        "name": "Refresher Orb",
        "cost": 5000,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Double Static Storm is devastating."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Glimpse to return heroes who have teleported to lane.",
        "Set up kills with your Glimpse -> Kinetic Field -> Static Storm combo.",
        "Harass with Thunder Strike in lane.",
        "Stay in the backline and control fights.",
        "Communicate with your team when you are looking for a Glimpse play."
      ],
      "donts": [
        "Don't use Glimpse on a hero who is already close to you.",
        "Don't get caught out of position.",
        "Don't waste your ultimate on a single support.",
        "Don't stack your stuns with other stuns.",
        "Don't try to be a damage dealer."
      ],
      "tips": [
        "Glimpse can be used on enemies who have used Blink Dagger or Force Staff.",
        "Kinetic Field is a great zoning tool, even if you don't trap anyone.",
        "Static Storm silences enemies inside it.",
        "Aghanim's Scepter upgrade is one of the strongest in the game, completely disabling heroes with items like BKB or Manta.",
        "Aghanim's Shard is also amazing, allowing Thunder Strike to hit multiple targets."
      ]
    },
    "gameplan": {
      "early": "Be a menace in lane. Harass with Thunder Strike and look for Glimpse opportunities on heroes who overextend. You have strong kill potential.",
      "mid": "Play with your team and look for pickoffs. Your combo can lock down and kill almost any hero. Control teamfights with well-placed ultimates.",
      "late": "You are the ultimate counter-initiator. Wait for the enemy to commit, then punish them with your full combo. An Agh's-upgraded ultimate on their carry can win the game."
    }
  },
  {
    "heroId": "doom",
    "mood": "aggressive",
    "items": [
      {
        "id": "phase_boots",
        "name": "Phase Boots",
        "cost": 1500,
        "phase": "Early",
        "priority": "Core",
        "description": "Armor and mobility."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Early",
        "priority": "Core",
        "description": "Essential for getting in range to cast Doom."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Ensures you can cast your ultimate without being interrupted."
      },
      {
        "id": "shivas_guard",
        "name": "Shiva's Guard",
        "cost": 4850,
        "phase": "Mid",
        "priority": "Core",
        "description": "Armor, intelligence, and a powerful slow."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Makes Doom last until the target dies and applies a break."
      },
      {
        "id": "refresher_orb",
        "name": "Refresher Orb",
        "cost": 5000,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Taking two heroes out of a fight is game-winning."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Doom on the most important enemy hero.",
        "Use Devour on a creep with a valuable aura (like the Wolf's crit aura).",
        "Farm the jungle efficiently with Devour and Scorched Earth.",
        "Initiate fights with Blink and Doom.",
        "Communicate your Doom target to your team."
      ],
      "donts": [
        "Don't waste Doom on a support if a core is available.",
        "Don't get caught without your ultimate ready.",
        "Don't neglect farming your Blink Dagger.",
        "Don't forget that Scorched Earth heals you and damages enemies.",
        "Don't try to man-fight without your spells up."
      ],
      "tips": [
        "Doom disables passives and items, making it the ultimate shutdown spell.",
        "Devour gives you the abilities of the creep you eat.",
        "Aghanim's Scepter makes Doom an un-purgeable death sentence.",
        "Aghanim's Shard is amazing, giving Infernal Blade a stun.",
        "With a Refresher Orb, you can disable two key heroes for an entire fight."
      ]
    },
    "gameplan": {
      "early": "Farm, farm, farm. Use Devour to accelerate your gold income. Your goal is to get Blink Dagger as fast as possible. Once you have Doom, look for a gank.",
      "mid": "You are the ultimate pickoff hero. With Blink, find an important target, Doom them, and kill them with your team. This creates a 5v4 advantage.",
      "late": "Your role is to completely remove one, or with Refresher, two enemy heroes from the game. A successful Doom on the enemy carry is often an instant teamfight win."
    }
  },
  {
    "heroId": "dragon_knight",
    "mood": "aggressive",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Stats and attack speed."
      },
      {
        "id": "armlet_of_mordiggian",
        "name": "Armlet of Mordiggian",
        "cost": 2370,
        "phase": "Early",
        "priority": "Core",
        "description": "Huge boost to damage and survivability."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Mid",
        "priority": "Core",
        "description": "Essential for initiating with your Dragon Tail stun."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows you to sit in fights and deal damage in Dragon Form."
      },
      {
        "id": "assault",
        "name": "Assault Cuirass",
        "cost": 5125,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Armor reduction and attack speed."
      },
      {
        "id": "daedalus",
        "name": "Daedalus",
        "cost": 5150,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Massive physical damage boost."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Elder Dragon Form to push towers and fight.",
        "Initiate on key targets with Blink into Dragon Tail.",
        "Use Breathe Fire to farm waves and reduce enemy damage.",
        "Be the frontline tank for your team.",
        "Pressure objectives whenever your ultimate is up."
      ],
      "donts": [
        "Don't fight without your Elder Dragon Form if possible.",
        "Don't forget your stun is a projectile in human form but instant in dragon form.",
        "Don't build glass cannon items; your strength is your tankiness.",
        "Don't waste your ultimate's duration.",
        "Don't be afraid to tank tower shots in Dragon Form."
      ],
      "tips": [
        "Dragon's Blood provides huge amounts of armor and health regeneration.",
        "Elder Dragon Form's Corrosive Breath effect works on buildings.",
        "Breathe Fire reduces the base attack damage of affected enemies.",
        "Aghanim's Scepter gives you a fourth level of Elder Dragon Form, the Black Dragon, which is incredibly powerful.",
        "You are one of the most durable heroes in the game."
      ]
    },
    "gameplan": {
      "early": "Survive and farm. Use Breathe Fire to secure last hits. You are very tanky, so you can trade effectively. Once you hit 6, you can pressure the tower or look for a kill.",
      "mid": "With your ultimate and Blink, you are a powerful initiator. Jump on a target, stun them, and let your team follow up. Push towers whenever Dragon Form is active.",
      "late": "You are a durable frontline carry. Your job is to initiate, soak up damage and spells, and deal consistent damage to heroes and buildings."
    }
  },
  {
    "heroId": "drow_ranger",
    "mood": "experimental",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Attack speed and stats."
      },
      {
        "id": "dragon_lance",
        "name": "Dragon Lance",
        "cost": 1900,
        "phase": "Early",
        "priority": "Core",
        "description": "Increases your attack range, keeping you safe."
      },
      {
        "id": "yasha",
        "name": "Yasha",
        "cost": 2050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Movement speed and attack speed, builds into Manta or S&Y."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Essential for dealing damage without being disabled."
      },
      {
        "id": "butterfly",
        "name": "Butterfly",
        "cost": 4975,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Massive boost to damage, attack speed, and evasion."
      },
      {
        "id": "satanic",
        "name": "Satanic",
        "cost": 5050,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Survivability and a strong dispel."
      }
    ],
    "playstyle": {
      "dos": [
        "Position yourself in the back of fights to maximize your ultimate's bonus.",
        "Use Gust to silence and knock back enemies.",
        "Use Frost Arrows to kite and chase enemies.",
        "Farm efficiently with Multishot.",
        "Push towers quickly with your high damage."
      ],
      "donts": [
        "Don't let enemies get close to you; it disables your ultimate.",
        "Don't get caught out of position; you are very fragile.",
        "Don't waste Gust; it's your only defensive spell.",
        "Don't build items that don't give you agility.",
        "Don't stand still in fights; always be kiting."
      ],
      "tips": [
        "Marksmanship is disabled if an enemy hero is within 400 range.",
        "Your ultimate provides bonus agility to nearby ranged allies.",
        "Gust reveals invisible units in its path.",
        "A Hurricane Pike (from Dragon Lance) is a core item for repositioning.",
        "Aghanim's Scepter causes your attacks to splinter, hitting multiple targets."
      ]
    },
    "gameplan": {
      "early": "Focus on last hitting. You are weak and vulnerable, so play safely. Use Frost Arrows to harass if possible, but prioritize farm above all.",
      "mid": "With a few items, you start to deal immense damage. Stay in the back of fights and let your team create space for you. Use your damage to take objectives quickly.",
      "late": "You are a glass cannon powerhouse. Your positioning determines whether you win or lose a fight. If protected, you can melt the entire enemy team."
    }
  },
  {
    "heroId": "earth_spirit",
    "mood": "creative",
    "items": [
      {
        "id": "urn_of_shadows",
        "name": "Urn of Shadows",
        "cost": 880,
        "phase": "Early",
        "priority": "Core",
        "description": "Provides sustain and damage after successful ganks."
      },
      {
        "id": "tranquil_boots",
        "name": "Tranquil Boots",
        "cost": 1000,
        "phase": "Early",
        "priority": "Core",
        "description": "HP regen and movement speed for roaming."
      },
      {
        "id": "spirit_vessel",
        "name": "Spirit Vessel",
        "cost": 2780,
        "phase": "Mid",
        "priority": "Core",
        "description": "Upgrade to Urn, essential for dealing with tanky heroes."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Makes you a mobile teamfight controller."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Late",
        "priority": "Situational",
        "description": "For better initiation and escape."
      },
      {
        "id": "shivas_guard",
        "name": "Shiva's Guard",
        "cost": 4850,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Armor, intelligence, and a powerful slow."
      }
    ],
    "playstyle": {
      "dos": [
        "Roam the map and create opportunities with your ganks.",
        "Learn your spell combinations (kick-stun, pull-silence).",
        "Use Magnetize on multiple heroes in a teamfight.",
        "Save allies by kicking them out of danger.",
        "Place remnants strategically for future plays."
      ],
      "donts": [
        "Don't waste your remnants.",
        "Don't be idle; you are a tempo-setting hero.",
        "Don't try to be a right-clicker.",
        "Don't miss your skillshots; they are crucial.",
        "Don't forget you can kick allies."
      ],
      "tips": [
        "You can kick a remnant to stun, or kick an enemy/ally.",
        "You can pull a remnant to silence.",
        "Rolling Boulder's distance and speed are increased if you roll over a remnant.",
        "Magnetize spreads to nearby enemies and refreshes its duration if you hit them with another spell.",
        "Aghanim's Scepter lets you become a remnant, allowing for insane mobility and re-positioning."
      ]
    },
    "gameplan": {
      "early": "Be a hyper-active roamer. Gank mid at level 2. Gank the safe lane. Your goal is to win the other lanes for your team.",
      "mid": "Continue to set the tempo. Your team should play around your initiations. A good multi-hero ultimate can win a teamfight.",
      "late": "You transition into a powerful utility hero. Your role is to control key targets, save allies, and spread your ultimate. With Agh's, you become incredibly hard to kill."
    }
  },
  {
    "heroId": "earthshaker",
    "mood": "creative",
    "items": [
      {
        "id": "arcane_boots",
        "name": "Arcane Boots",
        "cost": 1300,
        "phase": "Early",
        "priority": "Core",
        "description": "Essential mana sustain."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Early",
        "priority": "Core",
        "description": "Your most important item. Non-negotiable."
      },
      {
        "id": "force_staff",
        "name": "Force Staff",
        "cost": 2200,
        "phase": "Mid",
        "priority": "Situational",
        "description": "For added mobility and to break tethers like Slark's Pounce."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Turns Enchant Totem into a ranged, mobile stun."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Late",
        "priority": "Situational",
        "description": "To ensure you can get your full combo off."
      },
      {
        "id": "shivas_guard",
        "name": "Shiva's Guard",
        "cost": 4850,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Armor and a powerful slow to combo with your ultimate."
      }
    ],
    "playstyle": {
      "dos": [
        "Initiate fights with Blink into Echo Slam.",
        "Use Fissure to block paths and secure kills.",
        "Chain-stun enemies with your spells.",
        "Stay hidden and wait for the perfect moment to jump.",
        "Communicate your Blink timing to your team."
      ],
      "donts": [
        "Don't show yourself before a fight; you are most effective as a surprise.",
        "Don't waste Echo Slam on one or two heroes (unless they are crucial).",
        "Don't block your own teammates with Fissure.",
        "Don't neglect farming your Blink Dagger.",
        "Don't forget Aftershock procs after every spell."
      ],
      "tips": [
        "Echo Slam deals more damage the more enemies (including creeps and illusions) are nearby.",
        "Fissure creates an impassable wall for a short duration.",
        "Aghanim's Scepter allows you to jump around teamfights, stunning everyone.",
        "You can use Enchant Totem and then blink to deliver the hit.",
        "A well-placed Fissure can trap an entire team."
      ]
    },
    "gameplan": {
      "early": "Play as a support, looking for opportunities with Fissure. Your main goal is to secure enough farm and gold for a fast Blink Dagger.",
      "mid": "With Blink Dagger, you are the game's ultimate initiator. Hide in the trees, wait for the enemy to group up, and land a devastating Echo Slam.",
      "late": "You are a walking nuke. A single good Echo Slam can instantly win a teamfight. Play patiently and look for that game-changing moment."
    }
  },
  {
    "heroId": "elder_titan",
    "mood": "creative",
    "items": [
      {
        "id": "phase_boots",
        "name": "Phase Boots",
        "cost": 1500,
        "phase": "Early",
        "priority": "Core",
        "description": "Mobility and armor."
      },
      {
        "id": "echo_sabre",
        "name": "Echo Sabre",
        "cost": 2500,
        "phase": "Early",
        "priority": "Core",
        "description": "Synergizes well with your high base damage and passive."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Grants you spell immunity while channeling your ultimate."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows you to stand in fights and right-click."
      },
      {
        "id": "assault",
        "name": "Assault Cuirass",
        "cost": 5125,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Armor reduction and attack speed."
      },
      {
        "id": "refresher_orb",
        "name": "Refresher Orb",
        "cost": 5000,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Double Earth Splitter is devastating."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Astral Spirit to scout and deal damage.",
        "Land your Echo Stomp -> Earth Splitter combo.",
        "Position your Astral Spirit to hit as many heroes as possible.",
        "Utilize the armor and magic resistance reduction from your passive.",
        "Communicate your ultimate timing with your team."
      ],
      "donts": [
        "Don't miss your combo; it's your main contribution.",
        "Don't forget to recall your spirit; it gives you bonus damage and speed.",
        "Don't try to be a hard carry; you are a utility core.",
        "Don't get caught without your spirit nearby.",
        "Don't waste Earth Splitter."
      ],
      "tips": [
        "Natural Order removes all base armor and magic resistance from nearby enemies.",
        "Astral Spirit gives you bonus damage and movement speed for each unit it hits.",
        "You can cast Echo Stomp while the spirit is still moving.",
        "The classic combo is Spirit -> Stomp -> Ult -> recall Spirit.",
        "Aghanim's Scepter makes you much harder to kill during your combo."
      ]
    },
    "gameplan": {
      "early": "Dominate your lane with the armor reduction from your aura and the damage from your spirit. You have high kill potential with a support.",
      "mid": "You are a teamfight monster. Your combo can disable and heavily damage the entire enemy team. Play around your ultimate's cooldown.",
      "late": "You are a powerful initiator and damage amplifier. The armor reduction from your aura makes enemy heroes melt to your carry's physical attacks."
    }
  },
  {
    "heroId": "ember_spirit",
    "mood": "creative",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Stats and attack speed."
      },
      {
        "id": "maelstrom",
        "name": "Maelstrom",
        "cost": 2700,
        "phase": "Early",
        "priority": "Core",
        "description": "Synergizes with Sleight of Fist for wave clear and damage."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows you to fight without being locked down."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Increases Fire Remnant cast range and speed, making you a global threat."
      },
      {
        "id": "shivas_guard",
        "name": "Shiva's Guard",
        "cost": 4850,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Armor, intelligence, and a powerful slow."
      },
      {
        "id": "daedalus",
        "name": "Daedalus",
        "cost": 5150,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Massive physical damage with Sleight of Fist."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Sleight of Fist to harass, farm, and dodge spells.",
        "Always keep a Fire Remnant in a safe place for escape.",
        "Use your mobility to split push and apply pressure.",
        "Chain your Searing Chains and Sleight of Fist for maximum effect.",
        "Jump on vulnerable backline heroes."
      ],
      "donts": [
        "Don't get silenced; it's your biggest weakness.",
        "Don't use all your Fire Remnants to engage without an escape plan.",
        "Don't try to man-fight without Flame Guard up.",
        "Don't be predictable with your remnant placement.",
        "Don't forget you are invulnerable during Sleight of Fist."
      ],
      "tips": [
        "You can cast spells and use items during Sleight of Fist.",
        "The classic combo is Sleight of Fist -> Searing Chains.",
        "With Aghanim's Scepter, you can place a remnant in the fountain and zip across the map to engage, then zip back.",
        "Flame Guard absorbs magic damage and deals damage around you.",
        "This hero has a very high skill ceiling; practice is key."
      ]
    },
    "gameplan": {
      "early": "Survive the lane and get your levels. Use Flame Guard to farm and trade. Once you have your ultimate, you become much safer and can look for kills.",
      "mid": "You are a mobile and elusive damage dealer. Split push lanes, force reactions, and join fights from unexpected angles using your remnants. ",
      "late": "You transition into a powerful teamfighter who can deal massive AoE damage from a safe distance. Your role is to wear down the enemy team and pick off key targets."
    }
  },
  {
    "heroId": "enchantress",
    "mood": "experimental",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Attack speed and stats."
      },
      {
        "id": "dragon_lance",
        "name": "Dragon Lance",
        "cost": 1900,
        "phase": "Early",
        "priority": "Core",
        "description": "Increases your attack range, which is crucial for Impetus."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Gives you bonus attack range and makes Impetus pierce spell immunity."
      },
      {
        "id": "hurricane_pike",
        "name": "Hurricane Pike",
        "cost": 4450,
        "phase": "Mid",
        "priority": "Core",
        "description": "Essential for positioning and maximizing Impetus damage."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Late",
        "priority": "Situational",
        "description": "To deal with heavy magic burst or lockdown."
      },
      {
        "id": "scythe_of_vyse",
        "name": "Scythe of Vyse",
        "cost": 5675,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Hard lockdown to ensure you can get your damage off."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Impetus from a long distance to deal massive damage.",
        "Kite enemies with your movement speed from Nature's Attendants.",
        "Use Enchant to take control of powerful jungle creeps.",
        "Push towers with your enchanted creeps.",
        "Position yourself at the maximum attack range in fights."
      ],
      "donts": [
        "Don't get too close to enemies.",
        "Don't try to tank physical damage; you are weak to it.",
        "Don't forget to use Nature's Attendants to heal yourself and allies.",
        "Don't pick Enchantress against heroes with high physical burst.",
        "Don't neglect micro-managing your enchanted creep."
      ],
      "tips": [
        "Impetus deals pure damage based on the distance the projectile travels.",
        "Untouchable severely slows the attack speed of anyone who attacks you.",
        "You can use Enchant on enemy summons (like Eidolons or Forge Spirits).",
        "Hurricane Pike is your best friend, creating distance to amplify Impetus damage.",
        "Aghanim's Scepter is core, allowing you to hit BKB'd targets."
      ]
    },
    "gameplan": {
      "early": "Dominate your lane. Your high base damage and Impetus make you a huge threat. Enchant a creep to add even more pressure. ",
      "mid": "You are a powerful right-clicker. With Dragon Lance and Agh's, you can kill heroes from a very safe distance. Push towers and take control of the map.",
      "late": "You are a glass cannon that deals immense pure damage. Your positioning is absolutely critical. Stay far back and pelt the enemy team with Impetus."
    }
  },
  {
    "heroId": "enigma",
    "mood": "creative",
    "items": [
      {
        "id": "arcane_boots",
        "name": "Arcane Boots",
        "cost": 1300,
        "phase": "Early",
        "priority": "Core",
        "description": "Mana sustain."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Early",
        "priority": "Core",
        "description": "Absolutely essential for landing Black Hole."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Guarantees you can channel your ultimate without being interrupted."
      },
      {
        "id": "refresher_orb",
        "name": "Refresher Orb",
        "cost": 5000,
        "phase": "Mid",
        "priority": "Core",
        "description": "Double Black Hole is the most game-changing combo in Dota."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Adds a continuous pull to Black Hole, making it even harder to escape."
      },
      {
        "id": "octarine_core",
        "name": "Octarine Core",
        "cost": 5275,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Reduces the cooldown of your game-winning ultimate."
      }
    ],
    "playstyle": {
      "dos": [
        "Farm the jungle efficiently with Demonic Conversion.",
        "Use Malefice to stun and interrupt.",
        "Land a multi-hero Black Hole.",
        "Communicate with your team when your ultimate is ready.",
        "Push towers with your Eidolons."
      ],
      "donts": [
        "Don't show yourself on the map before a big fight.",
        "Don't use Black Hole on a single hero unless absolutely necessary.",
        "Don't get your Black Hole cancelled.",
        "Don't neglect farming your Blink and BKB.",
        "Don't forget to use Midnight Pulse under your Black Hole for extra damage."
      ],
      "tips": [
        "Black Hole pierces spell immunity.",
        "Demonic Conversion instantly kills a creep and gives you three Eidolons.",
        "Eidolons multiply after a certain number of attacks.",
        "Midnight Pulse deals damage based on a percentage of max HP.",
        "The fear of your Black Hole is often as powerful as the spell itself."
      ]
    },
    "gameplan": {
      "early": "Farm the jungle. Use your Eidolons to stack camps and accelerate your farm. Your goal is to get Blink Dagger as fast as possible.",
      "mid": "With Blink and Black Hole, you are the ultimate teamfight hero. Hide, wait for the perfect opportunity, and land a massive ultimate to win the fight for your team.",
      "late": "Your job is to land a game-winning Black Hole. With BKB and Refresher, you can single-handedly turn the tide of any game. Be patient and wait for your moment."
    }
  },
  {
    "heroId": "faceless_void",
    "mood": "experimental",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Attack speed and stats."
      },
      {
        "id": "mask_of_madness",
        "name": "Mask of Madness",
        "cost": 1775,
        "phase": "Early",
        "priority": "Core",
        "description": "Cheap attack speed and lifesteal for farming and fighting in Chrono."
      },
      {
        "id": "maelstrom",
        "name": "Maelstrom",
        "cost": 2700,
        "phase": "Mid",
        "priority": "Core",
        "description": "Farming tool and damage inside Chronosphere."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Prevents you from being disabled after Chronosphere ends."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Makes Time Dilation apply in a large AoE and reduces Chrono cooldown."
      },
      {
        "id": "butterfly",
        "name": "Butterfly",
        "cost": 4975,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Evasion, damage, and attack speed."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Chronosphere to catch key enemy heroes.",
        "Use Time Walk to dodge spells and heal damage.",
        "Coordinate your Chronosphere with your teammates' abilities.",
        "Farm efficiently between your ultimate's cooldown.",
        "Focus on killing the targets inside your Chronosphere."
      ],
      "donts": [
        "Don't trap your own teammates in Chronosphere.",
        "Don't use Chronosphere on a single support if you can get more.",
        "Don't get caught without Time Walk available.",
        "Don't build pure damage without attack speed.",
        "Don't be afraid to use Chronosphere defensively to save your team."
      ],
      "tips": [
        "Time Walk backtracks damage taken in the last 2 seconds.",
        "Time Lock can proc on the first hit of an attack.",
        "You can move freely inside your Chronosphere, but no one else can (except with specific abilities).",
        "Aghanim's Shard is amazing, allowing Time Walk to apply a stun.",
        "Practice placing your Chronosphere so it only catches enemies."
      ]
    },
    "gameplan": {
      "early": "Focus on farming. Use Time Walk to stay alive. You are weak until you get your ultimate and a few items.",
      "mid": "With your ultimate, you are a powerful ganker and teamfighter. Look for opportunities to catch key heroes and kill them inside Chronosphere.",
      "late": "You are a hard carry with one of the best teamfight ultimates in the game. A good Chronosphere can win the game on its own. Your job is to catch and kill the enemy's most important heroes."
    }
  },
  {
    "heroId": "grimstroke",
    "mood": "creative",
    "items": [
      {
        "id": "arcane_boots",
        "name": "Arcane Boots",
        "cost": 1300,
        "phase": "Early",
        "priority": "Core",
        "description": "Mana sustain."
      },
      {
        "id": "aether_lens",
        "name": "Aether Lens",
        "cost": 2275,
        "phase": "Mid",
        "priority": "Core",
        "description": "Increases cast range, keeping you safe."
      },
      {
        "id": "force_staff",
        "name": "Force Staff",
        "cost": 2200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Positioning and saving tool."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Core",
        "description": "Creates a powerful illusion that can cast spells."
      },
      {
        "id": "scythe_of_vyse",
        "name": "Scythe of Vyse",
        "cost": 5675,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Doubled by your ultimate, this is a devastating lockdown tool."
      },
      {
        "id": "shivas_guard",
        "name": "Shiva's Guard",
        "cost": 4850,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Armor, intelligence, and a powerful slow."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Soulbind on two key enemy heroes.",
        "Combo your spells with your allies' single-target spells.",
        "Use Stroke of Fate to harass and clear waves.",
        "Use Phantom's Embrace to silence and damage.",
        "Position yourself safely in the back of fights."
      ],
      "donts": [
        "Don't get caught out of position; you are very fragile.",
        "Don't waste Soulbind on targets that are far apart.",
        "Don't forget that Ink Swell stuns and damages when it expires.",
        "Don't try to be a right-clicker.",
        "Don't neglect vision."
      ],
      "tips": [
        "Soulbind causes any single-target spell cast on one bound hero to also be cast on the other.",
        "This works with items like Scythe of Vyse and Abyssal Blade.",
        "You can cast Ink Swell on an initiating ally to create a powerful AoE stun.",
        "Stroke of Fate deals more damage for each enemy it hits.",
        "Aghanim's Scepter is very strong, creating an illusion that mimics your spell casts."
      ]
    },
    "gameplan": {
      "early": "Harass the enemy lane with Stroke of Fate. You have strong kill potential with your silence and an allied stunner. ",
      "mid": "You are a powerful teamfight controller. A well-placed Soulbind can completely turn a fight, especially when combo'd with a hero like Lina or Lion.",
      "late": "You are the ultimate force multiplier. Your job is to enable your teammates to disable and kill multiple heroes at once. Position safely and land your key spells."
    }
  },
  {
    "heroId": "gyrocopter",
    "mood": "explosive",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Stats and attack speed."
      },
      {
        "id": "dragon_lance",
        "name": "Dragon Lance",
        "cost": 1900,
        "phase": "Early",
        "priority": "Core",
        "description": "Attack range and stats."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Essential for dealing damage in teamfights."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Gives you a powerful side-gunner that attacks automatically."
      },
      {
        "id": "satanic",
        "name": "Satanic",
        "cost": 5050,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Survivability and a strong dispel."
      },
      {
        "id": "daedalus",
        "name": "Daedalus",
        "cost": 5150,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Massive physical damage boost."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Rocket Barrage to deal massive damage to isolated targets.",
        "Farm stacks of creeps with Flak Cannon.",
        "Use Call Down to slow and damage a large area in teamfights.",
        "Use Homing Missile for vision and to force enemies out of position.",
        "Fight with your team during your power spikes."
      ],
      "donts": [
        "Don't get too close with Rocket Barrage against multiple heroes.",
        "Don't waste Flak Cannon on a single creep.",
        "Don't get caught without BKB in a teamfight.",
        "Don't neglect farming; you are an item-dependent carry.",
        "Don't forget Homing Missile can be easily destroyed."
      ],
      "tips": [
        "Flak Cannon hits all enemies in a large radius, including invisible units.",
        "Rocket Barrage is most effective against a single target.",
        "Call Down applies two separate slows and damage instances.",
        "Aghanim's Scepter is a huge damage increase and allows you to attack while stunned.",
        "You can build either for magic damage (with Maelstrom) or physical damage (with Daedalus)."
      ]
    },
    "gameplan": {
      "early": "You are a strong laner with high kill potential. Use Rocket Barrage and your spells to dominate the lane. Farm efficiently towards your core items.",
      "mid": "With BKB and Agh's, you are a teamfight monster. Your AoE damage is immense. Group up with your team and take objectives.",
      "late": "You are a powerful teamfight carry. Your job is to stay alive and dish out as much AoE damage as possible with Flak Cannon and your ultimate."
    }
  },
  {
    "heroId": "hoodwink",
    "mood": "creative",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Stats and attack speed."
      },
      {
        "id": "maelstrom",
        "name": "Maelstrom",
        "cost": 2700,
        "phase": "Early",
        "priority": "Core",
        "description": "Farming tool and damage."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Causes Sharpshooter to apply a debuff that deals massive damage."
      },
      {
        "id": "daedalus",
        "name": "Daedalus",
        "cost": 5150,
        "phase": "Mid",
        "priority": "Core",
        "description": "Synergizes with your ultimate for huge burst damage."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Late",
        "priority": "Situational",
        "description": "To deal with heavy lockdown."
      },
      {
        "id": "bloodthorn",
        "name": "Bloodthorn",
        "cost": 6800,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Silence and massive critical damage."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Bushwhack to stun enemies near trees.",
        "Use Acorn Shot to set up your stun.",
        "Use Sharpshooter to snipe heroes from a long distance.",
        "Play around trees to maximize your effectiveness.",
        "Use Scurry to dodge attacks and move through trees."
      ],
      "donts": [
        "Don't fight in open areas with no trees.",
        "Don't miss your Sharpshooter.",
        "Don't get caught out of position; you are very fragile.",
        "Don't forget Scurry gives you phased movement.",
        "Don't neglect farming."
      ],
      "tips": [
        "The combo is Acorn Shot -> Bushwhack for a guaranteed stun.",
        "Sharpshooter deals more damage the longer you charge it.",
        "You can move while charging Sharpshooter.",
        "Scurry has a passive chance to evade physical attacks when you are near trees.",
        "Aghanim's Scepter turns you into a one-shot machine."
      ]
    },
    "gameplan": {
      "early": "Harass the enemy with Acorn Shot. Look for kill opportunities with your stun combo near trees. Farm your Maelstrom.",
      "mid": "You are a powerful ganker and damage dealer. With Agh's, you can pick off almost any hero on the map. Play from the trees and control vision.",
      "late": "You are a glass cannon sniper. Your job is to stay in the back, land your stuns, and one-shot a key target with your ultimate."
    }
  },
  {
    "heroId": "huskar",
    "mood": "aggressive",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Stats and attack speed."
      },
      {
        "id": "armlet_of_mordiggian",
        "name": "Armlet of Mordiggian",
        "cost": 2370,
        "phase": "Early",
        "priority": "Core",
        "description": "The quintessential Huskar item. Synergizes perfectly with your kit."
      },
      {
        "id": "heavens_halberd",
        "name": "Heaven's Halberd",
        "cost": 3550,
        "phase": "Mid",
        "priority": "Core",
        "description": "Evasion, stats, and a disarm for enemy carries."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Prevents you from being bursted by magic damage at low HP."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Makes Life Break taunt the enemy, providing lockdown."
      },
      {
        "id": "satanic",
        "name": "Satanic",
        "cost": 5050,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Massive lifesteal and a strong dispel."
      }
    ],
    "playstyle": {
      "dos": [
        "Dominate your lane with Burning Spears.",
        "Use Life Break to initiate on key targets.",
        "Toggle your Armlet to stay alive at low HP.",
        "Play aggressively when you have the advantage.",
        "Take Roshan early with your high damage and sustain."
      ],
      "donts": [
        "Don't pick Huskar against heavy pure damage or breaks (like AA or Viper).",
        "Don't jump in without knowing where the rest of the enemy team is.",
        "Don't forget to use Inner Fire to disarm and push enemies away.",
        "Don't fight without Armlet.",
        "Don't be afraid to be at low health; that's where you are strongest."
      ],
      "tips": [
        "Berserker's Blood gives you massive attack speed and health regen at low HP.",
        "Burning Spears deal magic damage over time and stack.",
        "Life Break slows the target and deals a percentage of their current HP as damage.",
        "Armlet toggling is a crucial skill to master on this hero.",
        "Aghanim's Scepter turns your ultimate into a BKB-piercing taunt."
      ]
    },
    "gameplan": {
      "early": "Win your lane, hard. Spam Burning Spears on the enemy hero and force them out of lane. Get Armlet and start taking over the map.",
      "mid": "You are the game's tempo setter. Your goal is to snowball. Take Roshan, take towers, and force fights. You are incredibly strong in the mid-game.",
      "late": "Your power falls off. You need to end the game during your mid-game peak. If the game goes late, you need BKB and other luxury items to stay relevant."
    }
  },
  {
    "heroId": "invoker",
    "mood": "creative",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Attack speed and stat switching (for Quas/Wex build)."
      },
      {
        "id": "spirit_vessel",
        "name": "Spirit Vessel",
        "cost": 2780,
        "phase": "Mid",
        "priority": "Core",
        "description": "Synergizes with Cold Snap and provides stats for ganking (Q/W)."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Adds a third spell and reduces Invoke cooldown."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Late",
        "priority": "Core",
        "description": "Allows you to get your full combo off without interruption."
      },
      {
        "id": "scythe_of_vyse",
        "name": "Scythe of Vyse",
        "cost": 5675,
        "phase": "Late",
        "priority": "Luxury",
        "description": "The ultimate lockdown tool to set up your combos."
      },
      {
        "id": "octarine_core",
        "name": "Octarine Core",
        "cost": 5275,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Cooldown reduction for more spell casting."
      }
    ],
    "playstyle": {
      "dos": [
        "Practice your spell combinations.",
        "Invoke the spells you need before a fight starts.",
        "Adapt your build (Quas/Wex vs Quas/Exort) to the game.",
        "Use Alacrity on your carry or yourself to push towers.",
        "Use Sunstrike globally to secure kills."
      ],
      "donts": [
        "Don't get caught without the right spells invoked.",
        "Don't panic and misclick your spells.",
        "Don't neglect farming; you are very level-dependent.",
        "Don't try to be a right-clicker without an Exort build.",
        "Don't stand in the frontline."
      ],
      "tips": [
        "Quas provides health regen, Wex provides move/attack speed, Exort provides damage.",
        "The Tornado -> EMP -> Cold Snap combo is standard for Quas/Wex.",
        "The Tornado -> Meteor -> Deafening Blast combo is standard for Quas/Exort.",
        "Ghost Walk is your primary escape tool.",
        "This hero has the highest skill ceiling in the game. Practice is mandatory."
      ]
    },
    "gameplan": {
      "early": "Focus on getting levels. Your power is directly tied to the levels in your orbs and ultimate. Farm safely and use Sunstrike to help other lanes.",
      "mid": "Depending on your build, you either become a ganking machine (Q/W) or a massive teamfight damage dealer (Q/E). Play around your spell cooldowns and control the tempo.",
      "late": "You are a master of wizardry. With items like Scythe and Refresher, you can single-handedly control and win a teamfight with a dizzying array of spells."
    }
  },
  {
    "heroId": "io",
    "mood": "experimental",
    "items": [
      {
        "id": "mekansm",
        "name": "Mekansm",
        "cost": 1775,
        "phase": "Early",
        "priority": "Core",
        "description": "Early game teamfight healing."
      },
      {
        "id": "holy_locket",
        "name": "Holy Locket",
        "cost": 2350,
        "phase": "Mid",
        "priority": "Core",
        "description": "Amplifies your healing from Tether and Mekansm."
      },
      {
        "id": "guardian_greaves",
        "name": "Guardian Greaves",
        "cost": 4950,
        "phase": "Mid",
        "priority": "Core",
        "description": "Combines your boots and Mek, providing a dispel."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Permanently tethers to all allies, a massive team-wide buff."
      },
      {
        "id": "heart",
        "name": "Heart of Tarrasque",
        "cost": 5000,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Increases your own survivability and the healing you provide."
      },
      {
        "id": "overwhelming_blink",
        "name": "Overwhelming Blink",
        "cost": 6800,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Turns Io into a surprising initiator."
      }
    ],
    "playstyle": {
      "dos": [
        "Tether to an ally and stay with them.",
        "Use Relocate to save allies or gank enemies across the map.",
        "Use your heals and buffs to keep your tethered partner alive.",
        "Position your Spirits to scout and deal damage.",
        "Communicate your Relocate plans to your team."
      ],
      "donts": [
        "Don't get caught alone; you are useless without an ally.",
        "Don't break your Tether by moving too far away.",
        "Don't Relocate into a 5-man enemy team.",
        "Don't forget to click 'return' on your Relocate.",
        "Don't try to be a damage dealer (unless going for a meme build)."
      ],
      "tips": [
        "Tether gives both you and your ally bonus movement speed and shares your regeneration.",
        "Overcharge drains your HP/Mana to give your tethered ally massive damage reduction and attack speed.",
        "Relocate has a delay, so plan accordingly.",
        "Aghanim's Shard is amazing, causing Tether to stun enemies it passes through.",
        "You are the ultimate force multiplier for a single core."
      ]
    },
    "gameplan": {
      "early": "Babysit your carry. Keep them healed, provide them with attack speed, and set up kills with your stun.",
      "mid": "With Relocate, you and your partner become a global ganking threat. Look for pickoffs on any isolated hero.",
      "late": "Your job is to make your carry unkillable. With items like Greaves and Locket, you can sustain them through almost anything. An Agh's Scepter turns your entire team into a juggernaut."
    }
  },
  {
    "heroId": "jakiro",
    "mood": "chaos",
    "items": [
      {
        "id": "arcane_boots",
        "name": "Arcane Boots",
        "cost": 1300,
        "phase": "Early",
        "priority": "Core",
        "description": "Mana sustain."
      },
      {
        "id": "euls_scepter_of_divinity",
        "name": "Eul's Scepter of Divinity",
        "cost": 2625,
        "phase": "Mid",
        "priority": "Core",
        "description": "Mana regen, speed, and a setup for your Ice Path."
      },
      {
        "id": "force_staff",
        "name": "Force Staff",
        "cost": 2200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Positioning and saving tool."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Core",
        "description": "Makes Macropyre pure damage and last longer, a huge upgrade."
      },
      {
        "id": "shivas_guard",
        "name": "Shiva's Guard",
        "cost": 4850,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Armor, intelligence, and a powerful slow."
      },
      {
        "id": "octarine_core",
        "name": "Octarine Core",
        "cost": 5275,
        "phase": "Late",
        "priority": "Luxury",
        "description": "More spells, more control."
      }
    ],
    "playstyle": {
      "dos": [
        "Use your spells to control teamfights and push lanes.",
        "Land a good Ice Path to disable multiple enemies.",
        "Use Macropyre to zone enemies or deal massive damage in choke points.",
        "Harass with Dual Breath in lane.",
        "Push towers with Liquid Fire."
      ],
      "donts": [
        "Don't get caught out of position.",
        "Don't waste your ultimate on open ground.",
        "Don't stack your stun with other stuns.",
        "Don't try to be a right-clicker.",
        "Don't neglect vision."
      ],
      "tips": [
        "Ice Path has a delay, so you need to lead your targets.",
        "You can use Eul's Scepter on an enemy to guarantee your Ice Path lands.",
        "Liquid Fire is a great tool for harassing and pushing towers, as it doesn't draw creep aggro.",
        "Macropyre is extremely effective in narrow areas.",
        "Aghanim's Scepter turns your ultimate into a top-tier teamfight spell."
      ]
    },
    "gameplan": {
      "early": "Be a strong lane support. Harass with your spells and push the tower with Liquid Fire. You have good kill potential with Ice Path.",
      "mid": "You are a powerful teamfighter. Your combination of stuns, slows, and AoE damage is immense. Play with your team and take objectives.",
      "late": "Your role is to control space. A well-placed Macropyre can split a teamfight or melt heroes who are locked down. Position safely and spam your powerful spells."
    }
  },
  {
    "heroId": "juggernaut",
    "mood": "aggressive",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Stats and attack speed."
      },
      {
        "id": "maelstrom",
        "name": "Maelstrom",
        "cost": 2700,
        "phase": "Early",
        "priority": "Core",
        "description": "Farming tool and damage that procs during Omnislash."
      },
      {
        "id": "manta",
        "name": "Manta Style",
        "cost": 4600,
        "phase": "Mid",
        "priority": "Core",
        "description": "Dispels silences, increases farm speed, and provides stats."
      },
      {
        "id": "abyssal_blade",
        "name": "Abyssal Blade",
        "cost": 6250,
        "phase": "Mid",
        "priority": "Core",
        "description": "Lockdown to ensure kills."
      },
      {
        "id": "butterfly",
        "name": "Butterfly",
        "cost": 4975,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Evasion, damage, and attack speed."
      },
      {
        "id": "satanic",
        "name": "Satanic",
        "cost": 5050,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Survivability and a strong dispel."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Blade Fury for magic immunity and early game damage.",
        "Use Omnislash on isolated, key targets.",
        "Place your Healing Ward in a safe place during fights.",
        "Farm efficiently with your high base damage and Maelstrom.",
        "Push towers after a successful fight."
      ],
      "donts": [
        "Don't waste Omnislash on a group of creeps.",
        "Don't get caught without mana for Blade Fury.",
        "Don't place your Healing Ward in the middle of the fight.",
        "Don't try to man-fight without an item advantage.",
        "Don't forget you can use items during Blade Fury."
      ],
      "tips": [
        "You are magic immune during Blade Fury, but you can still be physically attacked.",
        "You can use Town Portal Scrolls during Blade Fury for a safe escape.",
        "Omnislash deals more damage if there is only one target nearby.",
        "Aghanim's Scepter gives you a mini-Omnislash with Swiftslash, a huge damage boost.",
        "Manta Style can dispel silences that prevent you from using Blade Fury or Omnislash."
      ]
    },
    "gameplan": {
      "early": "You are a strong laner. Use Blade Fury to secure kills or escape ganks. Focus on farming your core items.",
      "mid": "With your ultimate and a few items, you become a powerful ganker. Look for pickoffs on isolated heroes. Your Healing Ward allows you to take Roshan and objectives easily.",
      "late": "You are a well-rounded hard carry. Your job is to deal consistent physical damage and use Omnislash to eliminate a key enemy hero from the fight."
    }
  },
  {
    "heroId": "keeper_of_the_light",
    "mood": "defensive",
    "items": [
      {
        "id": "tranquil_boots",
        "name": "Tranquil Boots",
        "cost": 1000,
        "phase": "Early",
        "priority": "Core",
        "description": "Movement speed and HP regen."
      },
      {
        "id": "force_staff",
        "name": "Force Staff",
        "cost": 2200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Positioning and saving tool."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Unlocks Will-O-Wisp, a powerful teamfight control ultimate."
      },
      {
        "id": "holy_locket",
        "name": "Holy Locket",
        "cost": 2350,
        "phase": "Late",
        "priority": "Situational",
        "description": "Amplifies your Chakra Magic heal."
      },
      {
        "id": "octarine_core",
        "name": "Octarine Core",
        "cost": 5275,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Massive cooldown reduction for all your spells."
      },
      {
        "id": "scythe_of_vyse",
        "name": "Scythe of Vyse",
        "cost": 5675,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Hard lockdown."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Illuminate to push lanes and deal massive damage from a safe distance.",
        "Use Chakra Magic on your allies to restore their mana.",
        "Use Blinding Light to push enemies away and make them miss attacks.",
        "Use Spirit Form to gain powerful new abilities.",
        "Position yourself safely in the back of fights."
      ],
      "donts": [
        "Don't get caught while channeling Illuminate.",
        "Don't stand in the frontline.",
        "Don't forget Chakra Magic also reduces the cooldown of the target's last used spell.",
        "Don't waste your ultimate.",
        "Don't neglect vision."
      ],
      "tips": [
        "You can charge Illuminate and then release it in a different direction.",
        "In Spirit Form, Illuminate can be channeled by a separate spirit, allowing you to move freely.",
        "Chakra Magic is one of the best mana-sustain spells in the game.",
        "Will-O-Wisp (Agh's ultimate) continuously stuns enemies in a large area.",
        "Recall allows you to teleport an ally to your location."
      ]
    },
    "gameplan": {
      "early": "Play as a support, constantly pushing the lane with Illuminate. Provide mana for your laning partner and look for opportunities to gank with your team.",
      "mid": "You are a powerful teamfighter and pusher. An Agh's-upgraded ultimate can control a huge area. Depush dangerous lanes safely with Illuminate.",
      "late": "You are the ultimate utility support. Your job is to enable your team with mana, heals, and powerful crowd control. A well-placed Will-O-Wisp can win a fight."
    }
  },
  {
    "heroId": "kunkka",
    "mood": "creative",
    "items": [
      {
        "id": "phase_boots",
        "name": "Phase Boots",
        "cost": 1500,
        "phase": "Early",
        "priority": "Core",
        "description": "Damage and mobility."
      },
      {
        "id": "armlet_of_mordiggian",
        "name": "Armlet of Mordiggian",
        "cost": 2370,
        "phase": "Early",
        "priority": "Core",
        "description": "Massive damage boost for Tidebringer."
      },
      {
        "id": "daedalus",
        "name": "Daedalus",
        "cost": 5150,
        "phase": "Mid",
        "priority": "Core",
        "description": "The key to one-shotting heroes with Tidebringer."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows you to get your combo off and survive."
      },
      {
        "id": "divine_rapier",
        "name": "Divine Rapier",
        "cost": 5600,
        "phase": "Late",
        "priority": "Luxury",
        "description": "The ultimate high-risk, high-reward damage item."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Situational",
        "priority": "Situational",
        "description": "For better positioning of your combo."
      }
    ],
    "playstyle": {
      "dos": [
        "Land your X-Marks-the-Spot -> Torrent -> Ghostship combo.",
        "Use Tidebringer to cleave down creep waves and heroes.",
        "Use Ghostship to initiate or provide damage reduction for your team.",
        "Position yourself to hit multiple heroes with Tidebringer.",
        "Communicate your combo with your team."
      ],
      "donts": [
        "Don't miss your combo.",
        "Don't use X-Marks-the-Spot on an enemy with BKB or Manta.",
        "Don't stand in the frontline without BKB.",
        "Don't forget to time the return on X-Marks-the-Spot.",
        "Don't buy Divine Rapier if you are not confident you can stay alive."
      ],
      "tips": [
        "You can X-mark yourself or an ally, then have them teleport to base to heal, and then return them to the fight.",
        "Tidebringer is a guaranteed cleave attack every few seconds.",
        "Ghostship gives a buff to any ally it passes through.",
        "Practice the timing of your combo in demo mode.",
        "With enough damage, a single Tidebringer crit can wipe out the enemy's support heroes."
      ]
    },
    "gameplan": {
      "early": "Focus on farming. Use Tidebringer to secure last hits and harass. You have high kill potential with your combo once you hit level 6.",
      "mid": "With a few damage items, you become a terrifying burst damage hero. Look for pickoffs with your combo. A single good cleave can change a teamfight.",
      "late": "You are a walking nuke. Your job is to position yourself to land a devastating Tidebringer crit on the enemy backline. One hit can win the game."
    }
  },
  {
    "heroId": "legion_commander",
    "mood": "aggressive",
    "items": [
      {
        "id": "phase_boots",
        "name": "Phase Boots",
        "cost": 1500,
        "phase": "Early",
        "priority": "Core",
        "description": "Damage and mobility."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Early",
        "priority": "Core",
        "description": "Essential for initiating with Duel."
      },
      {
        "id": "blade_mail",
        "name": "Blade Mail",
        "cost": 2100,
        "phase": "Mid",
        "priority": "Core",
        "description": "Punishes enemies for attacking you during Duel."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Prevents enemies from saving your Duel target."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Makes you spell immune during Duel and reduces its cooldown."
      },
      {
        "id": "assault",
        "name": "Assault Cuirass",
        "cost": 5125,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Armor reduction and attack speed to help you win Duels."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Duel on vulnerable, high-priority targets.",
        "Use Press the Attack to heal and dispel allies.",
        "Farm the jungle with Overwhelming Odds.",
        "Snowball by winning Duels and gaining permanent damage.",
        "Communicate your Duel targets to your team."
      ],
      "donts": [
        "Don't Duel a hero you can't kill.",
        "Don't Duel without your team nearby to help.",
        "Don't neglect farming your Blink Dagger.",
        "Don't forget Press the Attack is a strong dispel.",
        "Don't Duel the enemy tank unless you have a massive advantage."
      ],
      "tips": [
        "A successful Duel grants you permanent bonus damage.",
        "Overwhelming Odds deals more damage the more units are in the area.",
        "Press the Attack provides a large amount of attack speed and health regen.",
        "Aghanim's Scepter makes you and your duel target immune to all other sources of damage for the duration.",
        "Blade Mail is your best friend for winning duels against high-damage heroes."
      ]
    },
    "gameplan": {
      "early": "Survive the lane and farm your Blink Dagger. Use Overwhelming Odds to harass and secure last hits. Once you have Duel, look for an easy pickoff on a support.",
      "mid": "You are the primary initiator. With Blink and Blade Mail, find an isolated target, Duel them, and get your team to help you secure the kill. Snowball from there.",
      "late": "Your job is to eliminate a key enemy hero from the fight. A successful Duel on the enemy carry can win the game. You become a formidable right-clicker with enough Duel damage."
    }
  },
  {
    "heroId": "leshrac",
    "mood": "aggressive",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Stats and survivability."
      },
      {
        "id": "bloodstone",
        "name": "Bloodstone",
        "cost": 4400,
        "phase": "Early",
        "priority": "Core",
        "description": "Essential for mana sustain and survivability."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows you to run at enemies without being disabled."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Upgrades Pulse Nova to be even more devastating."
      },
      {
        "id": "shivas_guard",
        "name": "Shiva's Guard",
        "cost": 4850,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Armor, intelligence, and a powerful slow."
      },
      {
        "id": "eternal_shroud",
        "name": "Eternal Shroud",
        "cost": 3100,
        "phase": "Situational",
        "priority": "Situational",
        "description": "Excellent against heavy magic damage."
      }
    ],
    "playstyle": {
      "dos": [
        "Use your spells to push towers and farm incredibly fast.",
        "Land your Split Earth stun.",
        "Run at enemies with Pulse Nova and BKB.",
        "Use Lightning Storm to slow and damage multiple targets.",
        "Be the frontline magic damage dealer for your team."
      ],
      "donts": [
        "Don't get caught without mana.",
        "Don't fight without BKB against heavy-disable lineups.",
        "Don't forget to toggle off Pulse Nova to conserve mana.",
        "Don't try to be a right-clicker.",
        "Don't miss your stun; it has a long cast animation."
      ],
      "tips": [
        "You can set up your Split Earth stun with Lightning Storm's slow or an ally's stun.",
        "Diabolic Edict deals physical damage and is great for melting towers.",
        "Bloodstone is core, providing the mana regeneration you need to keep Pulse Nova active.",
        "Aghanim's Scepter causes Pulse Nova to continuously slow and reduce enemy magic resistance.",
        "You are one of the fastest farmers and pushers in the game."
      ]
    },
    "gameplan": {
      "early": "Dominate your lane with your powerful nukes. Farm your Bloodstone as quickly as possible. You have high kill potential.",
      "mid": "With Bloodstone and BKB, you are a walking death machine. Group up with your team, turn on your ultimate, and run down towers and heroes.",
      "late": "You are a sustained magic damage powerhouse. Your job is to be in the middle of fights, dealing massive AoE damage. You scale incredibly well with items."
    }
  },
  {
    "heroId": "lich",
    "mood": "defensive",
    "items": [
      {
        "id": "tranquil_boots",
        "name": "Tranquil Boots",
        "cost": 1000,
        "phase": "Early",
        "priority": "Core",
        "description": "HP regen and movement speed."
      },
      {
        "id": "force_staff",
        "name": "Force Staff",
        "cost": 2200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Positioning and saving tool."
      },
      {
        "id": "glimmer_cape",
        "name": "Glimmer Cape",
        "cost": 1950,
        "phase": "Mid",
        "priority": "Core",
        "description": "A defensive tool to save yourself or allies."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Core",
        "description": "Makes Chain Frost bounce infinitely, a massive teamfight upgrade."
      },
      {
        "id": "aether_lens",
        "name": "Aether Lens",
        "cost": 2275,
        "phase": "Late",
        "priority": "Situational",
        "description": "Increases cast range, keeping you safe."
      },
      {
        "id": "octarine_core",
        "name": "Octarine Core",
        "cost": 5275,
        "phase": "Late",
        "priority": "Luxury",
        "description": "More spells, more control."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Chain Frost in teamfights where enemies are grouped together.",
        "Harass with Frost Blast in lane.",
        "Use Frost Shield on your initiator or to protect an ally.",
        "Use Sinister Gaze to control and drain mana from key targets.",
        "Position yourself safely in the back of fights."
      ],
      "donts": [
        "Don't waste Chain Frost on a single target.",
        "Don't get caught out of position.",
        "Don't forget Frost Shield provides damage reduction.",
        "Don't try to be a damage dealer outside of your ultimate.",
        "Don't stand still."
      ],
      "tips": [
        "Chain Frost deals more damage with each bounce.",
        "Frost Shield is an incredibly strong defensive spell that also damages and slows nearby enemies.",
        "Sinister Gaze forces an enemy to walk towards you, setting up for your allies.",
        "Aghanim's Scepter turns your ultimate into a potential team-wipe.",
        "Aghanim's Shard is also amazing, causing Ice Spire to attract your ultimate."
      ]
    },
    "gameplan": {
      "early": "Be a strong lane support. Harass with your nukes and use Frost Shield to win trades. You have good kill potential with a stunner.",
      "mid": "You are a powerful teamfighter. A well-placed Chain Frost can win a fight on its own. Play with your team and control fights from the backline.",
      "late": "Your role is to land a game-winning ultimate. With Aghanim's, you can completely lock down and destroy an enemy team that is clumped together."
    }
  },
  {
    "heroId": "lifestealer",
    "mood": "aggressive",
    "items": [
      {
        "id": "phase_boots",
        "name": "Phase Boots",
        "cost": 1500,
        "phase": "Early",
        "priority": "Core",
        "description": "Damage and mobility."
      },
      {
        "id": "armlet_of_mordiggian",
        "name": "Armlet of Mordiggian",
        "cost": 2370,
        "phase": "Early",
        "priority": "Core",
        "description": "Huge damage boost and survivability."
      },
      {
        "id": "desolator",
        "name": "Desolator",
        "cost": 3500,
        "phase": "Mid",
        "priority": "Core",
        "description": "Massive damage amplification."
      },
      {
        "id": "abyssal_blade",
        "name": "Abyssal Blade",
        "cost": 6250,
        "phase": "Mid",
        "priority": "Core",
        "description": "Lockdown to ensure kills."
      },
      {
        "id": "assault",
        "name": "Assault Cuirass",
        "cost": 5125,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Armor reduction and attack speed."
      },
      {
        "id": "satanic",
        "name": "Satanic",
        "cost": 5050,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Survivability and a strong dispel."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Rage to become magic immune and fight.",
        "Use Infest to gank or escape (an 'Infest bomb').",
        "Focus on killing one target at a time.",
        "Farm efficiently with your high damage.",
        "Communicate with your initiator for Infest ganks."
      ],
      "donts": [
        "Don't get kited; you have no natural gap close.",
        "Don't waste Rage; its cooldown is long.",
        "Don't try to man-fight without an item advantage.",
        "Don't forget Feast deals damage based on the target's max HP.",
        "Don't Infest a creep that is about to die."
      ],
      "tips": [
        "Rage provides magic immunity, but you can still be stunned by BKB-piercing abilities.",
        "You can Infest allied heroes, neutral creeps, or enemy creeps.",
        "When you emerge from an Infested unit, you deal AoE damage.",
        "Feast makes you a natural tank-buster.",
        "Aghanim's Scepter allows you to use Infest on enemy heroes, a powerful control tool."
      ]
    },
    "gameplan": {
      "early": "Focus on farming. You are a strong laner, but you need items to be effective. Get your Armlet and start looking for fights.",
      "mid": "You are a powerful single-target carry. Use Infest to join ganks with an initiator like Storm Spirit or Spirit Breaker. Take objectives after successful kills.",
      "late": "You are a formidable right-clicker. Your job is to get on top of a key target, pop Rage, and kill them. You excel at killing high-HP heroes."
    }
  },
  {
    "heroId": "lina",
    "mood": "aggressive",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Stats and attack speed."
      },
      {
        "id": "maelstrom",
        "name": "Maelstrom",
        "cost": 2700,
        "phase": "Early",
        "priority": "Core",
        "description": "Farming tool and damage that scales with your attack speed."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Essential for dealing damage without being disabled."
      },
      {
        "id": "daedalus",
        "name": "Daedalus",
        "cost": 5150,
        "phase": "Mid",
        "priority": "Core",
        "description": "Massive physical damage boost."
      },
      {
        "id": "satanic",
        "name": "Satanic",
        "cost": 5050,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Survivability and a strong dispel."
      },
      {
        "id": "hurricane_pike",
        "name": "Hurricane Pike",
        "cost": 4450,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Positioning tool and stats."
      }
    ],
    "playstyle": {
      "dos": [
        "Use your passive, Fiery Soul, to gain massive attack speed.",
        "Land your Light Strike Array stun.",
        "Use Laguna Blade to burst down a key target.",
        "Farm incredibly fast with Dragon Slave and your attack speed.",
        "Position yourself safely in the back of fights."
      ],
      "donts": [
        "Don't miss your stun.",
        "Don't get caught out of position; you are very fragile.",
        "Don't waste Laguna Blade on a target that is already dead.",
        "Don't stand still; kite and use your long attack range.",
        "Don't build for magic damage if you are playing the carry role."
      ],
      "tips": [
        "You can set up your stun with an ally's disable or a Eul's Scepter.",
        "Fiery Soul stacks up to three times, granting immense attack and movement speed.",
        "Aghanim's Scepter turns Laguna Blade into pure damage that pierces spell immunity.",
        "Lina can be played as a mid-lane magic burst hero or a safe-lane right-click carry.",
        "The right-click build is currently more popular and effective."
      ]
    },
    "gameplan": {
      "early": "Dominate your lane with your long range and powerful nukes. Focus on farming and getting your core items.",
      "mid": "You are a glass cannon damage dealer. With BKB, you can stand your ground and melt heroes with your incredible attack speed. Take objectives quickly.",
      "late": "You are a powerful right-click carry. Your job is to stay alive and deal massive sustained damage from the backline. One stun can lead to a solo kill on almost any hero."
    }
  },
  {
    "heroId": "lion",
    "mood": "chaos",
    "items": [
      {
        "id": "tranquil_boots",
        "name": "Tranquil Boots",
        "cost": 1000,
        "phase": "Early",
        "priority": "Core",
        "description": "HP regen and movement speed."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Mid",
        "priority": "Core",
        "description": "Essential for initiating with your disables."
      },
      {
        "id": "aether_lens",
        "name": "Aether Lens",
        "cost": 2275,
        "phase": "Mid",
        "priority": "Core",
        "description": "Increases cast range, keeping you safe."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Core",
        "description": "Makes Finger of Death an AoE nuke, a huge upgrade."
      },
      {
        "id": "force_staff",
        "name": "Force Staff",
        "cost": 2200,
        "phase": "Late",
        "priority": "Situational",
        "description": "Another positioning and saving tool."
      },
      {
        "id": "aeon_disk",
        "name": "Aeon Disk",
        "cost": 3000,
        "phase": "Late",
        "priority": "Situational",
        "description": "Prevents you from being instantly bursted down."
      }
    ],
    "playstyle": {
      "dos": [
        "Use your disables (Hex and Earth Spike) to lock down key targets.",
        "Use Finger of Death to secure kills.",
        "Roam the map and create gank opportunities.",
        "Use Mana Drain to sustain your mana and cripple enemies.",
        "Stay in the backline and control fights."
      ],
      "donts": [
        "Don't get caught out of position.",
        "Don't waste your ultimate on a target that is already dead.",
        "Don't try to be a right-clicker.",
        "Don't stack your disables on top of each other; chain them.",
        "Don't neglect farming your Blink Dagger."
      ],
      "tips": [
        "Each kill with Finger of Death permanently increases its damage.",
        "Hex is an instant, reliable disable.",
        "Earth Spike can hit multiple heroes in a line.",
        "Aghanim's Scepter turns your ultimate into a massive teamfight nuke.",
        "Aghanim's Shard is also amazing, allowing you to Mana Drain multiple targets."
      ]
    },
    "gameplan": {
      "early": "Be a roaming support. Your two disables give you incredible ganking potential. Secure kills for your cores and start stacking your ultimate.",
      "mid": "With Blink Dagger, you are a terrifying initiator. Jump on a key target, disable them for an eternity, and nuke them with Finger. ",
      "late": "You are a walking lockdown machine. Your job is to blink in, disable a key enemy hero, and hopefully take them out of the fight with your team's help. An Agh's-upgraded Finger can be devastating."
    }
  },
  {
    "heroId": "lone_druid",
    "mood": "creative",
    "items": [
      {
        "id": "phase_boots",
        "name": "Phase Boots",
        "cost": 1500,
        "phase": "Early",
        "priority": "Core",
        "description": "Damage and mobility for your Spirit Bear."
      },
      {
        "id": "mask_of_madness",
        "name": "Mask of Madness",
        "cost": 1775,
        "phase": "Early",
        "priority": "Core",
        "description": "Cheap attack speed and lifesteal for the bear."
      },
      {
        "id": "desolator",
        "name": "Desolator",
        "cost": 3500,
        "phase": "Mid",
        "priority": "Core",
        "description": "Massive damage amplification for the bear."
      },
      {
        "id": "assault",
        "name": "Assault Cuirass",
        "cost": 5125,
        "phase": "Mid",
        "priority": "Core",
        "description": "Armor reduction and attack speed for the bear."
      },
      {
        "id": "abyssal_blade",
        "name": "Abyssal Blade",
        "cost": 6250,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Lockdown for the bear."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Allows the bear to attack from anywhere and survive without the druid."
      }
    ],
    "playstyle": {
      "dos": [
        "Give all your items to your Spirit Bear.",
        "Use your bear to farm, fight, and push towers.",
        "Use True Form to become a tanky frontline hero.",
        "Keep your main hero safe in the back of fights.",
        "Micro-manage your bear effectively."
      ],
      "donts": [
        "Don't let your Spirit Bear die; its cooldown is long.",
        "Don't buy items for your main hero (in the bear build).",
        "Don't forget to re-summon your bear to refresh its health.",
        "Don't fight without your bear.",
        "Don't neglect your main hero's positioning."
      ],
      "tips": [
        "The Spirit Bear has its own inventory and can use most items.",
        "If the Lone Druid dies, the bear dies with him (unless you have Agh's).",
        "You can use the 'Return' ability to teleport the bear back to you.",
        "True Form makes you a durable melee hero with a powerful armor buff.",
        "Aghanim's Scepter is a game-changing item, making your bear a global threat."
      ]
    },
    "gameplan": {
      "early": "Dominate your lane with your Spirit Bear. Harass the enemy and secure last hits. You have high kill potential with the bear's Entangle.",
      "mid": "You are a powerful pusher and fighter. Your bear, decked out with items, can melt towers and heroes. Group up with your team and take objectives.",
      "late": "You are a unique hard carry. Your bear is your main source of damage. Your job is to keep your main hero safe while your bear wreaks havoc on the enemy team."
    }
  },
  {
    "heroId": "luna",
    "mood": "aggressive",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Stats and attack speed."
      },
      {
        "id": "mask_of_madness",
        "name": "Mask of Madness",
        "cost": 1775,
        "phase": "Early",
        "priority": "Core",
        "description": "Cheap lifesteal and attack speed for farming."
      },
      {
        "id": "manta",
        "name": "Manta Style",
        "cost": 4600,
        "phase": "Mid",
        "priority": "Core",
        "description": "Increases farm speed, provides stats, and illusions benefit from glaives."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Essential for surviving and dealing damage in teamfights."
      },
      {
        "id": "butterfly",
        "name": "Butterfly",
        "cost": 4975,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Evasion, damage, and attack speed."
      },
      {
        "id": "satanic",
        "name": "Satanic",
        "cost": 5050,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Survivability and a strong dispel."
      }
    ],
    "playstyle": {
      "dos": [
        "Farm incredibly fast with Moon Glaives.",
        "Use Eclipse to burst down heroes in teamfights.",
        "Push towers quickly with your high damage and glaives.",
        "Use Lucent Beam to secure kills or last hits.",
        "Fight with your team under the vision provided by your abilities."
      ],
      "donts": [
        "Don't get caught out of position; you are fragile.",
        "Don't use Eclipse when there are a lot of creeps nearby.",
        "Don't try to man-fight without BKB.",
        "Don't neglect farming; you are an item-dependent carry.",
        "Don't stand still in fights."
      ],
      "tips": [
        "Moon Glaives bounce to nearby enemies, making you an amazing farmer.",
        "Eclipse's beams are based on the level of Lucent Beam.",
        "Aghanim's Scepter allows you to cast Eclipse on an ally or an area, a huge tactical upgrade.",
        "Lunar Blessing provides bonus damage to nearby allies.",
        "You are strongest when fighting at night."
      ]
    },
    "gameplan": {
      "early": "Focus on farming. Use Moon Glaives to clear waves and jungle camps. You are one of the fastest farmers in the game.",
      "mid": "With Manta and BKB, you are a teamfight powerhouse. Your AoE damage is immense. Group up with your team and take objectives.",
      "late": "You are a hard carry that excels at teamfighting and base-sieging. Your job is to stay alive and let your glaives and ultimate do the work."
    }
  },
  {
    "heroId": "lycan",
    "mood": "aggressive",
    "items": [
      {
        "id": "helm_of_the_overlord",
        "name": "Helm of the Overlord",
        "cost": 6175,
        "phase": "Early",
        "priority": "Core",
        "description": "Creates a powerful army for pushing and fighting."
      },
      {
        "id": "assault",
        "name": "Assault Cuirass",
        "cost": 5125,
        "phase": "Mid",
        "priority": "Core",
        "description": "Buffs your entire army and makes you tankier."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows you to run at enemies without being disabled."
      },
      {
        "id": "abyssal_blade",
        "name": "Abyssal Blade",
        "cost": 6250,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Lockdown to kill key targets."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Allows one of your wolves to become a powerful hero."
      },
      {
        "id": "nullifier",
        "name": "Nullifier",
        "cost": 4375,
        "phase": "Late",
        "priority": "Situational",
        "description": "To deal with heroes who have Ghost Scepters or other save items."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Shapeshift to push towers and hunt heroes.",
        "Push lanes with your wolves.",
        "Take Roshan early with your army.",
        "Control the map with your high mobility.",
        "End the game quickly; you are a tempo-setting hero."
      ],
      "donts": [
        "Don't fight without your ultimate.",
        "Don't let your wolves die for free.",
        "Don't try to play a passive farming game.",
        "Don't get kited.",
        "Don't forget to micro your units."
      ],
      "tips": [
        "Shapeshift gives you max movement speed and critical strike.",
        "Feral Impulse is a powerful aura that gives bonus damage and HP regen to you and your units.",
        "You can control your wolves to scout, farm, and block enemies.",
        "Helm of the Overlord is your biggest power spike.",
        "Aghanim's Scepter gives you a fourth hero to control, which is incredibly strong."
      ]
    },
    "gameplan": {
      "early": "Dominate your lane with your wolves. Farm your Helm of the Overlord as fast as possible.",
      "mid": "You are a deathball pusher. Group up with your army, pop your ultimate, and run down a lane. Take Roshan, take towers, and force the enemy to react to you.",
      "late": "Your power falls off relative to other carries. Your goal is to end the game during your mid-game peak. If the game goes late, you need to split push and avoid 5v5 teamfights."
    }
  },
  {
    "heroId": "magnus",
    "mood": "creative",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Stats and attack speed."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Early",
        "priority": "Core",
        "description": "Essential for landing Reverse Polarity."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Ensures you can get your combo off."
      },
      {
        "id": "refresher_orb",
        "name": "Refresher Orb",
        "cost": 5000,
        "phase": "Mid",
        "priority": "Core",
        "description": "Double Reverse Polarity is game-winning."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Upgrades Horn Toss into a more spammable and powerful spell."
      },
      {
        "id": "shivas_guard",
        "name": "Shiva's Guard",
        "cost": 4850,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Armor, intelligence, and a powerful slow."
      }
    ],
    "playstyle": {
      "dos": [
        "Land a multi-hero Reverse Polarity.",
        "Use Skewer to bring enemies into your team or escape.",
        "Empower your melee carry to accelerate their farm.",
        "Farm with Shockwave and Empower's cleave.",
        "Coordinate your RP with your team's follow-up damage."
      ],
      "donts": [
        "Don't waste Reverse Polarity on a single support.",
        "Don't Skewer enemies away from your team by accident.",
        "Don't neglect farming your Blink Dagger.",
        "Don't forget to Empower your carry.",
        "Don't show yourself on the map before a big fight."
      ],
      "tips": [
        "Reverse Polarity pulls in and stuns all nearby enemies, piercing spell immunity.",
        "You can Skewer enemies up onto cliffs.",
        "Empower is one of the best farming steroids for melee heroes in the game.",
        "The classic combo is Blink -> Reverse Polarity -> Skewer them back into your team.",
        "Aghanim's Shard is amazing, giving Shockwave a return boomerang effect."
      ]
    },
    "gameplan": {
      "early": "Focus on farming your Blink Dagger. Use Empower on yourself to cleave down waves and jungle camps. You are very item-dependent.",
      "mid": "With Blink and RP, you are the ultimate teamfight initiator. Hide, wait for the enemy to group up, and land a massive ultimate. This is your biggest power spike.",
      "late": "Your job is to land a game-winning Reverse Polarity. With Refresher, you can completely control a teamfight. You are the ultimate wombo-combo enabler."
    }
  },
  {
    "heroId": "marci",
    "mood": "aggressive",
    "items": [
      {
        "id": "phase_boots",
        "name": "Phase Boots",
        "cost": 1500,
        "phase": "Early",
        "priority": "Core",
        "description": "Damage and mobility."
      },
      {
        "id": "armlet_of_mordiggian",
        "name": "Armlet of Mordiggian",
        "cost": 2370,
        "phase": "Early",
        "priority": "Core",
        "description": "Huge damage and survivability boost."
      },
      {
        "id": "skull_basher",
        "name": "Skull Basher",
        "cost": 2875,
        "phase": "Mid",
        "priority": "Core",
        "description": "Synergizes perfectly with the attack speed from Unleash."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Essential for using Unleash without being disabled."
      },
      {
        "id": "abyssal_blade",
        "name": "Abyssal Blade",
        "cost": 6250,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Upgrade to Basher for reliable lockdown."
      },
      {
        "id": "satanic",
        "name": "Satanic",
        "cost": 5050,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Survivability and a strong dispel."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Dispose to throw enemies into your team or into your Rebound stun.",
        "Use Rebound to initiate or escape.",
        "Use Sidekick to buff yourself and an ally with lifesteal and damage.",
        "Activate Unleash to become a terrifying fighter.",
        "Roam and create chaos."
      ],
      "donts": [
        "Don't miss your Rebound stun.",
        "Don't get kited during Unleash.",
        "Don't forget to use Sidekick on your carry.",
        "Don't try to be a hard carry; you are a tempo-setting brawler.",
        "Don't jump in without your team."
      ],
      "tips": [
        "The combo is Rebound onto an ally near an enemy, then Dispose the enemy back into the Rebound's AoE stun.",
        "Unleash provides a flurry of rapid attacks and a dispel on cast.",
        "Sidekick is an incredibly strong buff for any right-clicking hero.",
        "You can be played as a support, offlaner, or mid.",
        "Aghanim's Shard is amazing, giving Sidekick's target spell immunity for a short duration."
      ]
    },
    "gameplan": {
      "early": "Be a hyper-active roamer and ganker. Your combo of Dispose and Rebound is a guaranteed stun and kill with an ally's help. ",
      "mid": "With BKB and your ultimate, you are a formidable fighter. Jump on backline heroes and burst them down. Set the tempo for your team.",
      "late": "You transition into a utility core. Your job is to initiate, lock down a key target, and provide the Sidekick buff to your main carry."
    }
  },
  {
    "heroId": "mars",
    "mood": "aggressive",
    "items": [
      {
        "id": "phase_boots",
        "name": "Phase Boots",
        "cost": 1500,
        "phase": "Early",
        "priority": "Core",
        "description": "Damage and mobility."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Early",
        "priority": "Core",
        "description": "Essential for positioning your ultimate and spear."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows you to fight inside your Arena without being disabled."
      },
      {
        "id": "desolator",
        "name": "Desolator",
        "cost": 3500,
        "phase": "Mid",
        "priority": "Core",
        "description": "Massive damage amplification."
      },
      {
        "id": "satanic",
        "name": "Satanic",
        "cost": 5050,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Survivability and a strong dispel."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Makes you invulnerable and spews soldiers from your Arena."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Arena of Blood to trap key enemies.",
        "Spear enemies into the walls of your Arena or into trees.",
        "Use God's Rebuke to clear waves and deal burst damage.",
        "Be the frontline initiator for your team.",
        "Use Bulwark to block damage from the front."
      ],
      "donts": [
        "Don't miss your spear.",
        "Don't trap your own teammates in the Arena.",
        "Don't forget that Bulwark only blocks damage from the front and sides.",
        "Don't fight without your ultimate ready.",
        "Don't neglect farming your Blink Dagger."
      ],
      "tips": [
        "Arena of Blood blocks enemy movement and projectiles.",
        "A successful Spear of Mars stun is one of the longest in the game.",
        "The classic combo is Blink -> Arena -> Spear an enemy into the wall.",
        "God's Rebuke is a guaranteed critical strike and applies a knockback.",
        "Aghanim's Scepter turns your Arena into a death trap."
      ]
    },
    "gameplan": {
      "early": "Dominate your lane with your high base damage and God's Rebuke. Look for kill opportunities with your spear. Farm your Blink Dagger.",
      "mid": "You are the primary teamfight initiator. With Blink and Arena, you can trap and kill multiple enemies. Control the tempo and take objectives after successful fights.",
      "late": "You are a durable frontline controller. Your job is to initiate with a good Arena, lock down key targets, and soak up damage for your team."
    }
  },
  {
    "heroId": "medusa",
    "mood": "defensive",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Stats and attack speed."
      },
      {
        "id": "manta",
        "name": "Manta Style",
        "cost": 4600,
        "phase": "Early",
        "priority": "Core",
        "description": "Increases farm speed and survivability. Illusions benefit from Split Shot."
      },
      {
        "id": "eye_of_skadi",
        "name": "Eye of Skadi",
        "cost": 5300,
        "phase": "Mid",
        "priority": "Core",
        "description": "Massive stats, making you incredibly tanky and providing a slow."
      },
      {
        "id": "daedalus",
        "name": "Daedalus",
        "cost": 5150,
        "phase": "Mid",
        "priority": "Core",
        "description": "Massive physical damage boost."
      },
      {
        "id": "butterfly",
        "name": "Butterfly",
        "cost": 4975,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Evasion, damage, and attack speed."
      },
      {
        "id": "divine_rapier",
        "name": "Divine Rapier",
        "cost": 5600,
        "phase": "Late",
        "priority": "Luxury",
        "description": "The ultimate damage item for a hero who rarely dies."
      }
    ],
    "playstyle": {
      "dos": [
        "Farm, farm, and farm. You are one of the hardest carries in the game.",
        "Use Split Shot to clear waves and jungle camps simultaneously.",
        "Use Stone Gaze to turn fights and protect yourself.",
        "Use Mystic Snake to regain mana in lane.",
        "Build stat items to increase your EHP."
      ],
      "donts": [
        "Don't fight early; you are very weak without items.",
        "Don't get your mana burned.",
        "Don't forget to toggle on Split Shot when farming.",
        "Don't get caught out of position.",
        "Don't use Stone Gaze too early or too late."
      ],
      "tips": [
        "Mana Shield makes you incredibly tanky, absorbing damage using your mana pool.",
        "Stone Gaze forces enemies who look at you to turn to stone.",
        "Split Shot allows you to hit multiple targets at once, but with reduced damage.",
        "Aghanim's Scepter causes a free Mystic Snake to hit any petrified target.",
        "Your biggest counter is Anti-Mage or any hero with mana burn."
      ]
    },
    "gameplan": {
      "early": "Survive. Your only goal is to farm. Use Mystic Snake to harass and get mana. Avoid fights at all costs.",
      "mid": "Continue to farm. With Manta and Skadi, you start to come online. You can join fights, but you are still not at your peak. Your ultimate is a powerful defensive tool.",
      "late": "You are an unstoppable force. You can stand in the middle of a fight and mow down the entire enemy team. Your job is to be an unkillable siege engine that ends the game."
    }
  },
  {
    "heroId": "meepo",
    "mood": "chaos",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Stats and attack speed for all your Meepos."
      },
      {
        "id": "dragon_lance",
        "name": "Dragon Lance",
        "cost": 1900,
        "phase": "Early",
        "priority": "Core",
        "description": "Cheap and efficient stats."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Mid",
        "priority": "Core",
        "description": "Essential for initiating with your Poof combo."
      },
      {
        "id": "eye_of_skadi",
        "name": "Eye of Skadi",
        "cost": 5300,
        "phase": "Mid",
        "priority": "Core",
        "description": "Massive stats and a slow for all your Meepos."
      },
      {
        "id": "scythe_of_vyse",
        "name": "Scythe of Vyse",
        "cost": 5675,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Hard lockdown to ensure kills."
      },
      {
        "id": "heart",
        "name": "Heart of Tarrasque",
        "cost": 5000,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Makes all your Meepos incredibly tanky."
      }
    ],
    "playstyle": {
      "dos": [
        "Practice your micro-management.",
        "Use different control groups for your Meepos.",
        "Farm the entire map at once with your clones.",
        "Use your Poof -> Net combo to burst down heroes.",
        "End the game quickly; you are a snowballing hero."
      ],
      "donts": [
        "Don't pick Meepo if you can't micro.",
        "Don't let one of your clones die; if one dies, they all die.",
        "Don't pick Meepo against heavy AoE damage (like Lich or Winter Wyvern).",
        "Don't group all your Meepos together.",
        "Don't try to play a passive game."
      ],
      "tips": [
        "All your Meepos share the same boots, but get the stats from other items.",
        "You can send a low-HP Meepo back to the fountain to heal while the others continue to farm/fight.",
        "The classic combo is to Blink with your main Meepo and then Poof all your other Meepos onto the target.",
        "Earthbind (Net) can trap multiple enemies.",
        "This hero has the highest skill ceiling in terms of mechanics. Practice is mandatory."
      ]
    },
    "gameplan": {
      "early": "Get levels as fast as possible. Your power is directly tied to the number of Meepos you have. Once you have two or three, you can start dominating.",
      "mid": "You are the fastest farmer in the game. Choke the enemy out of resources by farming their jungle and all three lanes. Snowball out of control with successful ganks.",
      "late": "Your power falls off relative to other carries. You need to end the game during your mid-game peak. If the game goes late, you become a split-pushing menace."
    }
  },
  {
    "heroId": "mirana",
    "mood": "experimental",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Stats and attack speed."
      },
      {
        "id": "maelstrom",
        "name": "Maelstrom",
        "cost": 2700,
        "phase": "Early",
        "priority": "Core",
        "description": "Farming tool and damage."
      },
      {
        "id": "manta",
        "name": "Manta Style",
        "cost": 4600,
        "phase": "Mid",
        "priority": "Core",
        "description": "Dispels silences and increases farm speed."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "To survive and deal damage in fights."
      },
      {
        "id": "butterfly",
        "name": "Butterfly",
        "cost": 4975,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Evasion, damage, and attack speed."
      },
      {
        "id": "eye_of_skadi",
        "name": "Eye of Skadi",
        "cost": 5300,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Stats and a powerful slow."
      }
    ],
    "playstyle": {
      "dos": [
        "Land a long-range Sacred Arrow for a long stun.",
        "Use Leap to dodge spells and reposition.",
        "Use Moonlight Shadow to help your team initiate or escape.",
        "Farm efficiently with Starstorm.",
        "Set up your arrow with an ally's stun."
      ],
      "donts": [
        "Don't miss your arrow.",
        "Don't use Leap aggressively without an escape plan.",
        "Don't forget Moonlight Shadow has a fade time.",
        "Don't stand still; you are a mobile hero.",
        "Don't neglect farming."
      ],
      "tips": [
        "The stun duration of Sacred Arrow increases with the distance it travels.",
        "Leap gives you bonus attack and movement speed.",
        "Aghanim's Scepter causes Starstorm to rain down a second time on a nearby enemy.",
        "Mirana can be played in almost any role (carry, mid, support).",
        "Use your ultimate to get your whole team safely across the map for a gank."
      ]
    },
    "gameplan": {
      "early": "Harass the enemy and look for kill opportunities with Sacred Arrow. Farm your core items.",
      "mid": "You are a versatile hero who can gank, fight, and farm. Use your mobility to apply pressure across the map. A good arrow can lead to an easy pickoff.",
      "late": "Transition into a powerful right-click carry. Your job is to stay alive, deal damage, and provide utility with your arrow and ultimate."
    }
  },
  {
    "heroId": "monkey_king",
    "mood": "creative",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Stats and attack speed."
      },
      {
        "id": "echo_sabre",
        "name": "Echo Sabre",
        "cost": 2500,
        "phase": "Early",
        "priority": "Core",
        "description": "Synergizes perfectly with Jingu Mastery."
      },
      {
        "id": "desolator",
        "name": "Desolator",
        "cost": 3500,
        "phase": "Mid",
        "priority": "Core",
        "description": "Massive damage amplification."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows you to fight without being kited or disabled."
      },
      {
        "id": "abyssal_blade",
        "name": "Abyssal Blade",
        "cost": 6250,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Reliable lockdown."
      },
      {
        "id": "satanic",
        "name": "Satanic",
        "cost": 5050,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Survivability and a strong dispel."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Tree Dance to move around the map and gank.",
        "Land your Primal Spring for a slow and damage.",
        "Get your Jingu Mastery stacks before committing to a fight.",
        "Use Wukong's Command in teamfights.",
        "Play aggressively in lane."
      ],
      "donts": [
        "Don't fight on the ground if you can be on a tree.",
        "Don't get caught on the ground by heroes who can cut trees.",
        "Don't use Wukong's Command if the enemy can easily walk out of it.",
        "Don't forget to use your Mischief ability to trick enemies.",
        "Don't jump in without Jingu stacks."
      ],
      "tips": [
        "Jingu Mastery gives you massive bonus damage and lifesteal for a few hits.",
        "You are revealed on trees if the enemy has vision (wards, flying units).",
        "Wukong's Command creates an army of Monkey King soldiers that attack anyone in the circle.",
        "You can still use items and attack while inside your ultimate's circle.",
        "Aghanim's Scepter creates soldiers that follow you, a very powerful upgrade."
      ]
    },
    "gameplan": {
      "early": "Dominate your lane. Your high base damage and Jingu Mastery make you an incredibly strong laner. Look for solo kills.",
      "mid": "You are a powerful ganker and fighter. Use your mobility to find pickoffs and control the tempo. A good ultimate can win a teamfight.",
      "late": "You are a powerful right-click carry. Your job is to jump on backline heroes and burst them down. You excel at skirmishes and pickoffs."
    }
  }
]