[
  {
    "heroId": "pugna",
    "mood": "aggressive",
    "items": [
      {
        "id": "aether_lens",
        "name": "Aether Lens",
        "cost": 2275,
        "phase": "Early",
        "priority": "Core",
        "description": "Increases the cast range of all your spells, allowing for safer positioning."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Mid",
        "priority": "Core",
        "description": "Essential for repositioning to land a Nether Ward or escape after a Life Drain."
      },
      {
        "id": "kaya_and_sange",
        "name": "Kaya and Sange",
        "cost": 4100,
        "phase": "Mid",
        "priority": "Core",
        "description": "Makes you significantly tankier while boosting your spell damage and mana efficiency."
      },
      {
        "id": "dagon",
        "name": "Dagon",
        "cost": 2700,
        "phase": "Mid",
        "priority": "Luxury",
        "description": "Massive burst damage that synergizes perfectly with Decrepify's magic amplification."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Late",
        "priority": "Core",
        "description": "Allows you to safely channel a full duration Life Drain on a key target."
      },
      {
        "id": "scythe_of_vyse",
        "name": "Scythe of Vyse",
        "cost": 5550,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Provides reliable lockdown to ensure you can drain an enemy uninterrupted."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Nether Blast to push out lanes and damage towers from a safe distance.",
        "Place Nether Ward in hidden spots before a teamfight to punish enemy spellcasters.",
        "Use the Decrepify + Nether Blast combo to burst down heroes.",
        "Life Drain your Nether Ward for a burst of mana.",
        "Use Decrepify to save allies from physical damage or yourself."
      ],
      "donts": [
        "Don't get too close to the fight; you are extremely fragile.",
        "Don't forget that Decrepify makes targets immune to physical damage.",
        "Don't channel Life Drain on an enemy if you are in danger of being stunned.",
        "Don't waste Nether Ward; place it where it will have maximum impact.",
        "Don't hesitate to use Life Drain on an ally to save them."
      ],
      "tips": [
        "Decrepify can be cast on your Nether Ward to make it immune to physical attacks.",
        "Nether Blast also damages buildings.",
        "Aghanim's Scepter allows Life Drain to target two units and increases its power.",
        "Nether Ward deals damage based on the mana cost of spells used in its radius.",
        "You can deny yourself with Life Drain if you are about to die."
      ]
    },
    "gameplan": {
      "early": "Dominate your lane with Nether Blast spam. Push the tower early and force reactions from the enemy team.",
      "mid": "With Blink and Aether Lens, become a backline menace. Find pickoffs with your combo and control teamfights with well-placed Nether Wards.",
      "late": "Become a high-impact glass cannon. Your positioning is key to staying alive and dealing massive magic damage to win the game."
    }
  },
  {
    "heroId": "kunkka",
    "mood": "creative",
    "items": [
      {
        "id": "phase_boots",
        "name": "Phase Boots",
        "cost": 1500,
        "phase": "Early",
        "priority": "Core",
        "description": "Provides damage and mobility to land your spells and right clicks."
      },
      {
        "id": "armlet_of_mordiggian",
        "name": "Armlet of Mordiggian",
        "cost": 2370,
        "phase": "Early",
        "priority": "Core",
        "description": "Incredible stats for its cost, making your mid-game very strong."
      },
      {
        "id": "shadow_blade",
        "name": "Shadow Blade",
        "cost": 3000,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows you to position for a perfect combo or a surprise Tidebringer cleave."
      },
      {
        "id": "daedalus",
        "name": "Daedalus",
        "cost": 5150,
        "phase": "Mid",
        "priority": "Core",
        "description": "The first step to one-shotting supports with your Tidebringer."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Allows you to safely right-click in fights after your spells are used."
      },
      {
        "id": "divine_rapier",
        "name": "Divine Rapier",
        "cost": 5600,
        "phase": "Late",
        "priority": "Luxury",
        "description": "The ultimate high-risk, high-reward item to achieve the team-wiping cleave."
      }
    ],
    "playstyle": {
      "dos": [
        "Use the X Marks the Spot -> Torrent -> Ghostship combo to catch and kill heroes.",
        "Position yourself to hit multiple heroes with a single Tidebringer cleave.",
        "Use X Marks the Spot to safely scout or return to the fountain for mana/health.",
        "Use Ghostship to give your team damage reduction and movement speed in fights.",
        "Farm creep waves and jungle camps with Tidebringer."
      ],
      "donts": [
        "Don't miss your combo; practice the timing.",
        "Don't show in lane if you plan to gank with Shadow Blade.",
        "Don't build attack speed; your damage comes from single, powerful Tidebringer hits.",
        "Don't forget you can use X Marks the Spot on allies to save them.",
        "Don't buy a Divine Rapier if you are not confident you can stay alive."
      ],
      "tips": [
        "Tidebringer is a guaranteed cleave that is ready every few seconds, not a random chance.",
        "You can deny your own creeps from full HP with X Marks the Spot by returning them to the fountain.",
        "Ghostship provides vision as it travels.",
        "You can stack camps by hitting them with Tidebringer from a distance.",
        "Aghanim's Shard, Tidal Wave, is a great utility spell for pushing enemies."
      ]
    },
    "gameplan": {
      "early": "Control the lane with Tidebringer harass. Look for a kill opportunity with your combo once you hit level 6.",
      "mid": "With Shadow Blade and early damage items, roam the map looking for solo pickoffs. A successful combo can kill most supports.",
      "late": "Become a one-shot-wonder. Position in the fog of war and wait for the perfect moment to cleave down the enemy backline."
    }
  },
  {
    "heroId": "necrophos",
    "mood": "defensive",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Provides stats and attack speed, making you a more formidable laner."
      },
      {
        "id": "radiance",
        "name": "Radiance",
        "cost": 4700,
        "phase": "Mid",
        "priority": "Core",
        "description": "Accelerates your farm and makes you a constant threat in teamfights with its burn aura."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows you to stay in the fight and continuously heal without being disabled."
      },
      {
        "id": "shivas_guard",
        "name": "Shiva's Guard",
        "cost": 4850,
        "phase": "Late",
        "priority": "Core",
        "description": "Provides armor and a powerful AoE slow, making you even harder to kill and kite."
      },
      {
        "id": "heart_of_tarrasque",
        "name": "Heart of Tarrasque",
        "cost": 5000,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Makes you nearly unkillable, synergizing with your healing and Ghost Shroud."
      },
      {
        "id": "scythe_of_vyse",
        "name": "Scythe of Vyse",
        "cost": 5550,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Provides reliable lockdown to set up for Reaper's Scythe or control a dangerous core."
      }
    ],
    "playstyle": {
      "dos": [
        "Spam Death Pulse to sustain yourself and harass the enemy.",
        "Act as the frontline, forcing enemies to focus you while you heal through their damage.",
        "Use Ghost Shroud to avoid physical damage and amplify your healing.",
        "Secure kills on important targets with Reaper's Scythe.",
        "Farm aggressively once you have Radiance."
      ],
      "donts": [
        "Don't use Ghost Shroud if the enemy has high magic burst.",
        "Don't be afraid to use Reaper's Scythe on a target that isn't at low health to apply the long stun.",
        "Don't overextend without your team; you can be bursted down.",
        "Don't hold onto your ultimate for the 'perfect' kill; its low cooldown makes it spammable.",
        "Don't neglect Heartstopper Aura's constant damage; position yourself to affect multiple heroes."
      ],
      "tips": [
        "A kill with Reaper's Scythe adds permanent HP and Mana regeneration.",
        "Ghost Shroud makes you immune to physical damage but increases magic damage taken.",
        "Reaper's Scythe stun duration increases the lower the target's health.",
        "Death Pulse's projectile travels slowly, so lead your targets.",
        "Aghanim's Scepter reduces Heartstopper Aura's effectiveness but increases its damage."
      ]
    },
    "gameplan": {
      "early": "Win your lane through attrition. Constantly spam Death Pulse to out-sustain and whittle down your opponent.",
      "mid": "Once you have Radiance and BKB, become the center of your team. Run at the enemy, force fights, and be an unkillable menace.",
      "late": "Evolve into a true raid boss. Your goal is to be an immortal frontline force that wins long, drawn-out teamfights."
    }
  },
  {
    "heroId": "slardar",
    "mood": "aggressive",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Provides attack speed and strength for more damage and survivability."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Early",
        "priority": "Core",
        "description": "The quintessential item for initiating with Slithereen Crush."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows you to initiate and stay on your target without being disabled."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Provides bonus status resistance and magic resistance in puddles, making you incredibly tanky."
      },
      {
        "id": "assault",
        "name": "Assault Cuirass",
        "cost": 5125,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Amplifies your physical damage and makes you and your team much harder to kill."
      },
      {
        "id": "abyssal_blade",
        "name": "Abyssal Blade",
        "cost": 6225,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Provides a reliable, BKB-piercing lockdown to supplement your Crush."
      }
    ],
    "playstyle": {
      "dos": [
        "Constantly look for pickoffs with Blink and Slithereen Crush.",
        "Keep Corrosive Haze on as many enemy heroes as possible during a fight.",
        "Use Guardian Sprint to chase down enemies or escape.",
        "Focus on initiating onto key targets to start a fight.",
        "Fight in the river to take advantage of Guardian Sprint's bonus."
      ],
      "donts": [
        "Don't initiate without your team ready to follow up.",
        "Don't forget that Corrosive Haze provides vision of the target.",
        "Don't try to man-fight carries without having Haze on them first.",
        "Don't hesitate to use BKB before you blink in.",
        "Don't neglect farming; you need items to be an effective initiator."
      ],
      "tips": [
        "Corrosive Haze is a very low cooldown, low mana cost spell. Spam it.",
        "Aghanim's Scepter puddles from Crush and Haze provide significant bonuses.",
        "Slithereen Crush applies a slow after the stun.",
        "Bash of the Deep deals bonus physical damage, which is amplified by Haze.",
        "Your Aghanim's Shard makes Haze an AoE spell, great for teamfights."
      ]
    },
    "gameplan": {
      "early": "Survive the lane and get your Blink Dagger as fast as possible. Once you have it, the hunt begins.",
      "mid": "Become the primary initiator. Your job is to find a key target, Blink on them, and let your team blow them up. Control the map tempo.",
      "late": "Transition into a tanky frontliner who can repeatedly catch out-of-position heroes and enable your team's physical damage."
    }
  },
  {
    "heroId": "tidehunter",
    "mood": "chaos",
    "items": [
      {
        "id": "arcane_boots",
        "name": "Arcane Boots",
        "cost": 1300,
        "phase": "Early",
        "priority": "Core",
        "description": "Solves your early mana issues for Gush and Anchor Smash spam."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Early",
        "priority": "Core",
        "description": "Without this, you cannot reliably land a multi-hero Ravage."
      },
      {
        "id": "shivas_guard",
        "name": "Shiva's Guard",
        "cost": 4850,
        "phase": "Mid",
        "priority": "Core",
        "description": "Makes you extremely tanky and provides a powerful slow to keep enemies in your face."
      },
      {
        "id": "refresher_orb",
        "name": "Refresher Orb",
        "cost": 5000,
        "phase": "Late",
        "priority": "Luxury",
        "description": "The ultimate chaos item. Double Ravage wins games."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Makes Gush a massive, ground-targeted wave, adding even more control to your kit."
      },
      {
        "id": "octarine_core",
        "name": "Octarine Core",
        "cost": 4600,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Reduces the cooldown of your game-winning ultimate and other spells."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Anchor Smash to reduce enemy attack damage and farm creep waves.",
        "Land a multi-hero Ravage to win teamfights.",
        "Tank damage for your team; Kraken Shell makes you incredibly durable.",
        "Use Gush to slow and reduce the armor of key targets.",
        "Be the frontline and create space for your squishier teammates."
      ],
      "donts": [
        "Don't use Ravage on a single hero unless it's absolutely crucial.",
        "Don't be afraid to die after getting your spells off; that's your job.",
        "Don't stand in the backline; you need to be in the middle of the fight.",
        "Don't forget that Kraken Shell dispels debuffs when you take enough damage.",
        "Don't try to initiate without Blink Dagger."
      ],
      "tips": [
        "Anchor Smash's damage reduction works on buildings.",
        "Kraken Shell's dispel has a cooldown, so it won't trigger on every stun.",
        "Ravage expands outwards, so enemies in the center are stunned for longer.",
        "You can disassemble Arcane Boots later to build Octarine Core or other items.",
        "Aghanim's Shard gives you Tendrils on Ravage, which pulls enemies in."
      ]
    },
    "gameplan": {
      "early": "Be an unkillable lane bully. Use Anchor Smash to secure farm and reduce the enemy carry's damage output.",
      "mid": "Once you have Blink Dagger, you are the team's 'GO' button. Group up and look for fights where you can land a big Ravage.",
      "late": "Your only goal is to cause maximum chaos. Blink in, Ravage, Refresher, Ravage, and watch the enemy team melt."
    }
  },
  {
    "heroId": "gyrocopter",
    "mood": "aggressive",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Provides attack speed and stats to maximize your damage output."
      },
      {
        "id": "dragon_lance",
        "name": "Dragon Lance",
        "cost": 1900,
        "phase": "Early",
        "priority": "Core",
        "description": "Increases your attack range, allowing you to use Flak Cannon more safely."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Mid",
        "priority": "Core",
        "description": "Unlocks Side Gunner, turning you into a mobile turret that attacks constantly."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Essential for fighting without being disabled, allowing Flak Cannon and Side Gunner to do their work."
      },
      {
        "id": "satanic",
        "name": "Satanic",
        "cost": 5050,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Provides massive lifesteal and a dispel, making you very hard to kill in fights."
      },
      {
        "id": "daedalus",
        "name": "Daedalus",
        "cost": 5150,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Your Flak Cannon attacks can crit, leading to massive AoE physical damage."
      }
    ],
    "playstyle": {
      "dos": [
        "Use Rocket Barrage for early kill potential; it does immense damage if you're alone with a target.",
        "Activate Flak Cannon to hit the entire enemy team and farm waves quickly.",
        "Use Call Down to slow enemies and zone areas in a teamfight.",
        "Harass with Homing Missile from a safe distance.",
        "Fight early and often; you have a very strong mid-game."
      ],
      "donts": [
        "Don't get too close with Rocket Barrage; it has a small radius.",
        "Don't waste Flak Cannon on a single target.",
        "Don't neglect farming; you need items to scale into the late game.",
        "Don't fight without BKB against heavy-disable lineups.",
        "Don't forget to manually target Homing Missile; it can be easily destroyed."
      ],
      "tips": [
        "Call Down's two rockets have separate impacts and slows.",
        "Aghanim's Scepter's Side Gunner will prioritize the last hero you attacked.",
        "Flak Cannon has a limited number of attacks, not a duration.",
        "You can stack camps easily with Flak Cannon.",
        "A Maelstrom can be a good alternative early farming item if you have a free lane."
      ]
    },
    "gameplan": {
      "early": "Be aggressive. Your high magic burst from Rocket Barrage can secure early kills. Use Flak Cannon to secure ranged creeps.",
      "mid": "With Aghanim's and BKB, you are a teamfight monster. Group up with your team and force fights and objectives.",
      "late": "Transition into a powerful AoE physical damage carry. Position safely and let Flak Cannon and Side Gunner shred the enemy team."
    }
  },
  {
    "heroId": "viper",
    "mood": "experimental",
    "items": [
      {
        "id": "power_treads",
        "name": "Power Treads",
        "cost": 1400,
        "phase": "Early",
        "priority": "Core",
        "description": "Attack speed and stats are crucial for a right-click focused build."
      },
      {
        "id": "dragon_lance",
        "name": "Dragon Lance",
        "cost": 1900,
        "phase": "Early",
        "priority": "Core",
        "description": "Increases your attack range, making you a superior lane bully and kiter."
      },
      {
        "id": "manta_style",
        "name": "Manta Style",
        "cost": 4600,
        "phase": "Mid",
        "priority": "Core",
        "description": "Provides a dispel for silences and creates illusions that apply Poison Attack."
      },
      {
        "id": "black_king_bar",
        "name": "Black King Bar",
        "cost": 4050,
        "phase": "Mid",
        "priority": "Core",
        "description": "Allows you to sit in your Nethertoxin and right-click freely without being disabled."
      },
      {
        "id": "eye_of_skadi",
        "name": "Eye of Skadi",
        "cost": 5300,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Makes your slow inescapable and provides amazing stats for survivability."
      },
      {
        "id": "butterfly",
        "name": "Butterfly",
        "cost": 4975,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Massive boost to your damage, attack speed, and provides valuable evasion."
      }
    ],
    "playstyle": {
      "dos": [
        "Dominate your lane with Poison Attack spam.",
        "Use Nethertoxin to break enemy passives and secure last hits.",
        "Kite enemies with your superior range and slows.",
        "Use Viper Strike to lock down and kill a key target.",
        "Pressure towers whenever the enemy leaves the lane."
      ],
      "donts": [
        "Don't try to man-fight melee carries without kiting them first.",
        "Don't stand still; your strength is in movement and sustained damage.",
        "Don't forget Nethertoxin reduces magic resistance, amplifying your own spell damage.",
        "Don't waste Viper Strike on a support if you can get the enemy carry.",
        "Don't build like a magic nuker; this build focuses on right-click DPS."
      ],
      "tips": [
        "Poison Attack is a unique attack modifier and can be toggled.",
        "Nethertoxin's break is one of the most powerful abilities in the game against certain heroes.",
        "Viper Strike's damage and slow pierces spell immunity.",
        "Corrosive Skin will slow any enemy that damages you.",
        "Manta Style illusions benefit from your Poison Attack stacks."
      ]
    },
    "gameplan": {
      "early": "Win your lane. Hard. Harass the enemy out of the lane with Poison Attack and get a massive farm lead.",
      "mid": "With Manta and BKB, you are a formidable teamfighter. Place Nethertoxin and dare the enemy to fight you inside it.",
      "late": "Become an unkillable, kiting carry. Your job is to melt the enemy frontline while being too tanky and elusive to be killed."
    }
  },
  {
    "heroId": "winter-wyvern",
    "mood": "defensive",
    "items": [
      {
        "id": "tranquil_boots",
        "name": "Tranquil Boots",
        "cost": 925,
        "phase": "Early",
        "priority": "Core",
        "description": "Provides HP regeneration and movement speed to stay healthy while roaming and warding."
      },
      {
        "id": "glimmer_cape",
        "name": "Glimmer Cape",
        "cost": 1950,
        "phase": "Early",
        "priority": "Core",
        "description": "An essential save for yourself or an ally, especially during Cold Embrace."
      },
      {
        "id": "force_staff",
        "name": "Force Staff",
        "cost": 2200,
        "phase": "Mid",
        "priority": "Core",
        "description": "The ultimate utility item for saving allies, breaking leashes, or repositioning."
      },
      {
        "id": "aether_lens",
        "name": "Aether Lens",
        "cost": 2275,
        "phase": "Mid",
        "priority": "Core",
        "description": "Increases your cast range, allowing you to use your spells from a much safer distance."
      },
      {
        "id": "holy_locket",
        "name": "Holy Locket",
        "cost": 2400,
        "phase": "Late",
        "priority": "Luxury",
        "description": "Significantly amplifies the healing from Cold Embrace, making it a full heal."
      },
      {
        "id": "ghost_scepter",
        "name": "Ghost Scepter",
        "cost": 1500,
        "phase": "Late",
        "priority": "Luxury",
        "description": "A personal save against physical damage carries that jump on you."
      }
    ],
    "playstyle": {
      "dos": [
        "Save allies who are being focused with Cold Embrace.",
        "Use Winter's Curse on an enemy carry to make their team kill them.",
        "Harass and slow multiple enemies with Splinter Blast.",
        "Use Arctic Burn to fly over terrain and gain superior vision for scouting.",
        "Stay in the backline and position perfectly to land your spells."
      ],
      "donts": [
        "Don't use Cold Embrace on an ally who is being targeted by magic nukes.",
        "Don't cast Winter's Curse on a support if the enemy carry is nearby.",
        "Don't get caught out of position; you are the team's primary save.",
        "Don't use Arctic Burn to harass if it puts you in danger.",
        "Don't forget your allies cannot damage the target of Winter's Curse."
      ],
      "tips": [
        "Cold Embrace makes the target immune to physical damage.",
        "Winter's Curse taunts nearby allies of the target to attack them.",
        "Splinter Blast does not hit the initial target, only units around it.",
        "Arctic Burn applies a percentage-based health reduction, making it strong against tanky heroes.",
        "Aghanim's Scepter makes Arctic Burn a toggle with no cooldown, but it drains mana."
      ]
    },
    "gameplan": {
      "early": "Focus on protecting your core. Harass with Splinter Blast and be ready to use Cold Embrace to turn around a gank.",
      "mid": "With your utility items, your job is to be the ultimate savior. Position in the back and wait for the enemy to initiate, then counter with your spells.",
      "late": "A single well-placed Winter's Curse can win the game. Your positioning and decision-making are paramount."
    }
  },
  {
    "heroId": "nyx-assassin",
    "mood": "chaos",
    "items": [
      {
        "id": "arcane_boots",
        "name": "Arcane Boots",
        "cost": 1300,
        "phase": "Early",
        "priority": "Core",
        "description": "Provides the mana pool needed to spam your spells and roam effectively."
      },
      {
        "id": "blink",
        "name": "Blink Dagger",
        "cost": 2250,
        "phase": "Early",
        "priority": "Core",
        "description": "Allows for multi-hero Impales and perfect positioning for ganks."
      },
      {
        "id": "aether_lens",
        "name": "Aether Lens",
        "cost": 2275,
        "phase": "Mid",
        "priority": "Core",
        "description": "Increases the cast range of Impale and Mana Burn, making ganks easier and safer."
      },
      {
        "id": "dagon",
        "name": "Dagon",
        "cost": 2700,
        "phase": "Mid",
        "priority": "Luxury",
        "description": "Adds significant magic burst to your Vendetta strike combo."
      },
      {
        "id": "aghanims_scepter",
        "name": "Aghanim's Scepter",
        "cost": 4200,
        "phase": "Late",
        "priority": "Core",
        "description": "Unlocks Burrow, making you incredibly tanky and improving your spells' effectiveness."
      },
      {
        "id": "ethereal_blade",
        "name": "Ethereal Blade",
        "cost": 4700,
        "phase": "Late",
        "priority": "Luxury",
        "description": "The ultimate burst item, amplifying your Dagon and magic damage combo."
      }
    ],
    "playstyle": {
      "dos": [
        "Roam the map with Vendetta to find solo pickoffs.",
        "Use Mana Burn on high-intelligence heroes to cripple their mana pool.",
        "Use Blink Dagger to land multi-hero Impales.",
        "Use Spiked Carapace to reflect stuns and damage back at the enemy.",
        "Provide vision and information for your team while invisible."
      ],
      "donts": [
        "Don't break Vendetta with a right-click if you need the bonus damage on a key target.",
        "Don't try to initiate on multiple heroes without your team nearby.",
        "Don't neglect warding and de-warding; you are a natural carrier for detection.",
        "Don't forget that Spiked Carapace has a short duration.",
        "Don't build right-click items; your strength is in your spells."
      ],
      "tips": [
        "Vendetta's bonus damage is applied before the attack, allowing it to be amplified by effects like Ethereal Blade.",
        "You can cast spells and use items during Vendetta without breaking invisibility.",
        "Spiked Carapace blocks the damage instance that triggers it.",
        "Mana Burn's damage is based on the target's intelligence.",
        "Aghanim's Scepter's Burrow provides massive health regeneration and spell amplification."
      ]
    },
    "gameplan": {
      "early": "Gank the enemy mid-laner as soon as you hit level 6. Your goal is to create chaos and shut down the enemy's key spellcasters.",
      "mid": "With Blink and Aether Lens, you are a terrifying ganker. Hunt supports and intelligence cores across the map.",
      "late": "Transition into a disruptive utility hero. With Aghanim's, you can control fights from the safety of your Burrow, stunning and burning mana."
    }
  }
]